{
    "abstracts-retrieval-response": {
        "item": {
            "ait:process-info": {
                "ait:status": {
                    "@state": "update",
                    "@type": "core",
                    "@stage": "S300"
                },
                "ait:date-delivered": {
                    "@day": "01",
                    "@year": "2019",
                    "@timestamp": "2019-10-01T01:56:44.000044-04:00",
                    "@month": "10"
                },
                "ait:date-sort": {
                    "@day": "01",
                    "@year": "2018",
                    "@month": "01"
                }
            },
            "bibrecord": {
                "head": {
                    "author-group": [
                        {
                            "affiliation": {
                                "@afid": "60072485",
                                "affiliation-id": {
                                    "@afid": "60072485"
                                },
                                "ce:text": "Saint-Petersburg National Research University of Information Technologies, Mechanics and Optics, 49, Kronverksky pr., St. Petersburg, 197101, Russian Federation; e-mail: bershadskaya.lyudmila@gmail.com"
                            },
                            "author": [
                                {
                                    "preferred-name": {
                                        "ce:given-name": "L. A.",
                                        "ce:initials": "L.A.",
                                        "ce:surname": "Vidiasova",
                                        "ce:indexed-name": "Vidiasova L."
                                    },
                                    "@seq": "1",
                                    "ce:initials": "L.A.",
                                    "@date-locked": "2019-02-07T09:14:20.975",
                                    "@_fa": "true",
                                    "@type": "auth",
                                    "ce:surname": "Vidiasova",
                                    "@auid": "56962787200",
                                    "ce:indexed-name": "Vidiasova L.A."
                                },
                                {
                                    "preferred-name": {
                                        "ce:given-name": "I. A.",
                                        "ce:initials": "I.A.",
                                        "ce:surname": "Grigoryeva",
                                        "ce:indexed-name": "Grigoryeva I."
                                    },
                                    "@seq": "2",
                                    "ce:initials": "I.A.",
                                    "@_fa": "true",
                                    "@type": "auth",
                                    "ce:surname": "Grigoryeva",
                                    "@auid": "6507521314",
                                    "ce:indexed-name": "Grigoryeva I.A."
                                }
                            ]
                        },
                        {
                            "affiliation": {
                                "country": "Russian Federation",
                                "address-part": "7-9 ,Universitetskaya nab.",
                                "postal-code": "199034",
                                "@afid": "60031888",
                                "@country": "rus",
                                "city": "St. Petersburg",
                                "organization": {
                                    "$": "Saint Petersburg State University"
                                },
                                "affiliation-id": {
                                    "@afid": "60031888"
                                }
                            },
                            "author": [
                                {
                                    "preferred-name": {
                                        "ce:given-name": "I. A.",
                                        "ce:initials": "I.A.",
                                        "ce:surname": "Grigoryeva",
                                        "ce:indexed-name": "Grigoryeva I."
                                    },
                                    "@seq": "2",
                                    "ce:initials": "I.A.",
                                    "@_fa": "true",
                                    "@type": "auth",
                                    "ce:surname": "Grigoryeva",
                                    "@auid": "6507521314",
                                    "ce:indexed-name": "Grigoryeva I.A."
                                }
                            ]
                        }
                    ],
                    "citation-title": "Investigation of internet-communities' influence on the social inclusion of the elderly people through leisure practices",
                    "abstracts": "Modern society is characterized by the intensification of new interactions and new communities, in parallel with the interest in social exclusion-inclusion topic. As the Internet develops, the research interest is directed to studying the specifics of emerging communities in a virtual environment called as «online communities», «virtual communities» etc. The article presents the results of studying 7 online communities of older people in the social network VKontakte about leisure. The research was carried out on the basis of a network approach using automated data analysis tools that allows to evaluate communities characteristics, as well as information exchange processes between the participants. The method of network data analysis, automated online community analysis, as well as Gephi software packages and Socstat social network analysis service were used. In addition, qualitative data on content published in communities and offline activities were obtained. The study conducted came to conclusions about the formation of communities characterized by weak online connections between users of older age groups in VKontakte. In the studied groups, the real social community is formed initially in an offline environment where all key activities take place, and their organizers use social networks as one of the channels for informing the target audience. For effective social inclusion, it is necessary to maintain a certain level of trust in what is happening in the group and the information published, as well as relevant content that illuminates activities in an offline environment.Современное общество характеризуется интенсификацией новых видов взаимодействий и новых сообществ, параллельно с интересом к проблеме социальной эксклюзии-инклюзии. По мере развития интернета, исследовательский интерес направляется на изучение специфики сообществ, появляющихся в виртуальной среде и получивших название «онлайн-сообщества», «виртуальные сообщества», «интернет-сообщества» и т. д. В статье представлены результаты изучения семи онлайн-сообществ людей старшего возраста в социальной сети ВКонтакте досуговой направленности. Исследование проведено на основе сетевого подхода с применением средств автоматизированного анализа данных, позволяющего оценить характеристики сообществ, а также процессы информационного обмена между участниками. Использован метод сетевого анализа данных, автоматизированный веб-краулинг онлайн-сообществ, а также программные пакеты Gephi и сервис анализа социальных сетей Socstat. Кроме того, были получены качественные данные о контенте, публикуемом в сообществах, и мероприятиях в оффлайн-среде. Это позволило сделать выводы о формировании сообществ людей старшего возраста в социальной сети ВКонтакте низкой плотности и с преобладанием слабых связей между участниками. Установлено, что реальное социальное сообщество формируется изначально в оффлайн-среде, где происходят все ключевые мероприятия, а их организаторы используют площадки в социальных сетях как один из каналов информирования целевой аудитории. Для эффективной социальной инклюзии необходимо поддержание определенного уровня доверия к происходящему в группе и публикуемым сведениям, а также актуальный контент, освещающий мероприятия в оффлайн-среде.",
                    "citation-info": {
                        "author-keywords": {
                            "author-keyword": [
                                {
                                    "$": "elderly",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "engagement",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "network analysis",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "network approach",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "online communities",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "social inclusion",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "social networks",
                                    "@xml:lang": "eng"
                                },
                                {
                                    "$": "weak links",
                                    "@xml:lang": "eng"
                                }
                            ]
                        },
                        "citation-type": {
                            "@code": "ar"
                        },
                        "citation-language": {
                            "@language": "Russian",
                            "@xml:lang": "rus"
                        },
                        "abstract-language": {
                            "@language": "English",
                            "@xml:lang": "eng"
                        }
                    },
                    "source": {
                        "sourcetitle-abbrev": "Adv Gerontol",
                        "@country": "rus",
                        "translated-sourcetitle": {
                            "@xml:lang": "eng"
                        },
                        "issn": {
                            "$": "15619125",
                            "@type": "print"
                        },
                        "volisspag": {
                            "voliss": {
                                "@volume": "31",
                                "@issue": "4"
                            },
                            "pagerange": {
                                "@first": "597",
                                "@last": "603"
                            }
                        },
                        "@type": "j",
                        "publicationyear": {
                            "@first": "2018"
                        },
                        "publisher": {
                            "publishername": "NLM (Medline)"
                        },
                        "sourcetitle": "Advances in gerontology = Uspekhi gerontologii",
                        "@srcid": "52741",
                        "publicationdate": {
                            "month": "01",
                            "year": "2018",
                            "date-text": {
                                "@xfab-added": "true",
                                "$": "1 January 2018"
                            },
                            "day": "01"
                        }
                    },
                    "enhancement": {
                        "classificationgroup": {
                            "classifications": [
                                {
                                    "@type": "ASJC",
                                    "classification": "2700"
                                },
                                {
                                    "@type": "SUBJABBR",
                                    "classification": "MEDI"
                                }
                            ]
                        }
                    }
                },
                "item-info": {
                    "copyright": {
                        "$": "This record is sourced from MEDLINE/PubMed, a database of the U.S. National Library of Medicine",
                        "@type": "Medline"
                    },
                    "external-source": "MEDLINE",
                    "dbcollection": [
                        {
                            "$": "MEDL"
                        },
                        {
                            "$": "SCOPUS"
                        },
                        {
                            "$": "Scopusbase"
                        }
                    ],
                    "history": {
                        "date-created": {
                            "@day": "10",
                            "@year": "2019",
                            "@timestamp": "BST 08:56:42",
                            "@month": "07"
                        }
                    },
                    "itemidlist": {
                        "itemid": [
                            {
                                "$": "625780943",
                                "@idtype": "PUI"
                            },
                            {
                                "$": "914949624",
                                "@idtype": "CAR-ID"
                            },
                            {
                                "$": "30607926",
                                "@idtype": "MEDL"
                            },
                            {
                                "$": "316395899",
                                "@idtype": "OSIN"
                            },
                            {
                                "$": "85059502039",
                                "@idtype": "SCP"
                            },
                            {
                                "$": "85059502039",
                                "@idtype": "SGR"
                            }
                        ]
                    }
                },
                "tail": null
            }
        },
        "affiliation": [
            {
                "affiliation-city": "Saint Petersburg",
                "@id": "60072485",
                "affilname": "Saint Petersburg National Research University of Information Technologies, Mechanics and Optics University ITMO",
                "@href": "https://api.elsevier.com/content/affiliation/affiliation_id/60072485",
                "affiliation-country": "Russian Federation"
            },
            {
                "affiliation-city": "Saint Petersburg (ex Leningrad)",
                "@id": "60031888",
                "affilname": "Saint Petersburg State University",
                "@href": "https://api.elsevier.com/content/affiliation/affiliation_id/60031888",
                "affiliation-country": "Russian Federation"
            }
        ],
        "coredata": {
            "srctype": "j",
            "eid": "2-s2.0-85059502039",
            "dc:description": "Modern society is characterized by the intensification of new interactions and new communities, in parallel with the interest in social exclusion-inclusion topic. As the Internet develops, the research interest is directed to studying the specifics of emerging communities in a virtual environment called as «online communities», «virtual communities» etc. The article presents the results of studying 7 online communities of older people in the social network VKontakte about leisure. The research was carried out on the basis of a network approach using automated data analysis tools that allows to evaluate communities characteristics, as well as information exchange processes between the participants. The method of network data analysis, automated online community analysis, as well as Gephi software packages and Socstat social network analysis service were used. In addition, qualitative data on content published in communities and offline activities were obtained. The study conducted came to conclusions about the formation of communities characterized by weak online connections between users of older age groups in VKontakte. In the studied groups, the real social community is formed initially in an offline environment where all key activities take place, and their organizers use social networks as one of the channels for informing the target audience. For effective social inclusion, it is necessary to maintain a certain level of trust in what is happening in the group and the information published, as well as relevant content that illuminates activities in an offline environment. Современное общество характеризуется интенсификацией новых видов взаимодействий и новых сообществ, параллельно с интересом к проблеме социальной эксклюзии-инклюзии. По мере развития интернета, исследовательский интерес направляется на изучение специфики сообществ, появляющихся в виртуальной среде и получивших название «онлайн-сообщества», «виртуальные сообщества», «интернет-сообщества» и т. д. В статье представлены результаты изучения семи онлайн-сообществ людей старшего возраста в социальной сети ВКонтакте досуговой направленности. Исследование проведено на основе сетевого подхода с применением средств автоматизированного анализа данных, позволяющего оценить характеристики сообществ, а также процессы информационного обмена между участниками. Использован метод сетевого анализа данных, автоматизированный веб-краулинг онлайн-сообществ, а также программные пакеты Gephi и сервис анализа социальных сетей Socstat. Кроме того, были получены качественные данные о контенте, публикуемом в сообществах, и мероприятиях в оффлайн-среде. Это позволило сделать выводы о формировании сообществ людей старшего возраста в социальной сети ВКонтакте низкой плотности и с преобладанием слабых связей между участниками. Установлено, что реальное социальное сообщество формируется изначально в оффлайн-среде, где происходят все ключевые мероприятия, а их организаторы используют площадки в социальных сетях как один из каналов информирования целевой аудитории. Для эффективной социальной инклюзии необходимо поддержание определенного уровня доверия к происходящему в группе и публикуемым сведениям, а также актуальный контент, освещающий мероприятия в оффлайн-среде.",
            "pubmed-id": "30607926",
            "prism:coverDate": "2018-01-01",
            "prism:aggregationType": "Journal",
            "prism:url": "https://api.elsevier.com/content/abstract/scopus_id/85059502039",
            "dc:creator": {
                "author": [
                    {
                        "preferred-name": {
                            "ce:given-name": "L. A.",
                            "ce:initials": "L.A.",
                            "ce:surname": "Vidiasova",
                            "ce:indexed-name": "Vidiasova L."
                        },
                        "@seq": "1",
                        "ce:initials": "L.A.",
                        "@_fa": "true",
                        "affiliation": {
                            "@id": "60072485",
                            "@href": "https://api.elsevier.com/content/affiliation/affiliation_id/60072485"
                        },
                        "ce:surname": "Vidiasova",
                        "@auid": "56962787200",
                        "author-url": "https://api.elsevier.com/content/author/author_id/56962787200",
                        "ce:indexed-name": "Vidiasova L.A."
                    }
                ]
            },
            "link": [
                {
                    "@_fa": "true",
                    "@rel": "self",
                    "@href": "https://api.elsevier.com/content/abstract/scopus_id/85059502039"
                },
                {
                    "@_fa": "true",
                    "@rel": "scopus",
                    "@href": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85059502039&origin=inward"
                },
                {
                    "@_fa": "true",
                    "@rel": "scopus-citedby",
                    "@href": "https://www.scopus.com/inward/citedby.uri?partnerID=HzOxMe3b&scp=85059502039&origin=inward"
                }
            ],
            "source-id": "52741",
            "citedby-count": "0",
            "prism:volume": "31",
            "subtype": "ar",
            "dc:title": "Investigation of internet-communities' influence on the social inclusion of the elderly people through leisure practices",
            "openaccess": null,
            "prism:issn": "15619125",
            "prism:issueIdentifier": "4",
            "subtypeDescription": "Article",
            "prism:publicationName": "Advances in gerontology = Uspekhi gerontologii",
            "prism:pageRange": "597-603",
            "prism:endingPage": "603",
            "openaccessFlag": null,
            "prism:startingPage": "597",
            "dc:identifier": "SCOPUS_ID:85059502039",
            "dc:publisher": "NLM (Medline)"
        },
        "idxterms": {
            "mainterm": [
                {
                    "$": "Aged",
                    "@weight": "b",
                    "@candidate": "n"
                },
                {
                    "$": "Humans",
                    "@weight": "b",
                    "@candidate": "n"
                },
                {
                    "$": "Internet",
                    "@weight": "a",
                    "@candidate": "n"
                },
                {
                    "$": "Leisure Activities",
                    "@weight": "b",
                    "@candidate": "n"
                },
                {
                    "$": "Social Participation",
                    "@weight": "b",
                    "@candidate": "n"
                }
            ]
        },
        "language": {
            "@xml:lang": "eng"
        },
        "authkeywords": {
            "author-keyword": [
                {
                    "@_fa": "true",
                    "$": "elderly"
                },
                {
                    "@_fa": "true",
                    "$": "engagement"
                },
                {
                    "@_fa": "true",
                    "$": "network analysis"
                },
                {
                    "@_fa": "true",
                    "$": "network approach"
                },
                {
                    "@_fa": "true",
                    "$": "online communities"
                },
                {
                    "@_fa": "true",
                    "$": "social inclusion"
                },
                {
                    "@_fa": "true",
                    "$": "social networks"
                },
                {
                    "@_fa": "true",
                    "$": "weak links"
                }
            ]
        },
        "subject-areas": {
            "subject-area": [
                {
                    "@_fa": "true",
                    "$": "Medicine (all)",
                    "@code": "2700",
                    "@abbrev": "MEDI"
                }
            ]
        },
        "authors": {
            "author": [
                {
                    "preferred-name": {
                        "ce:given-name": "L. A.",
                        "ce:initials": "L.A.",
                        "ce:surname": "Vidiasova",
                        "ce:indexed-name": "Vidiasova L."
                    },
                    "@seq": "1",
                    "ce:initials": "L.A.",
                    "@_fa": "true",
                    "affiliation": {
                        "@id": "60072485",
                        "@href": "https://api.elsevier.com/content/affiliation/affiliation_id/60072485"
                    },
                    "ce:surname": "Vidiasova",
                    "@auid": "56962787200",
                    "author-url": "https://api.elsevier.com/content/author/author_id/56962787200",
                    "ce:indexed-name": "Vidiasova L.A."
                },
                {
                    "preferred-name": {
                        "ce:given-name": "I. A.",
                        "ce:initials": "I.A.",
                        "ce:surname": "Grigoryeva",
                        "ce:indexed-name": "Grigoryeva I."
                    },
                    "@seq": "2",
                    "ce:initials": "I.A.",
                    "@_fa": "true",
                    "affiliation": [
                        {
                            "@id": "60072485",
                            "@href": "https://api.elsevier.com/content/affiliation/affiliation_id/60072485"
                        },
                        {
                            "@id": "60031888",
                            "@href": "https://api.elsevier.com/content/affiliation/affiliation_id/60031888"
                        }
                    ],
                    "ce:surname": "Grigoryeva",
                    "@auid": "6507521314",
                    "author-url": "https://api.elsevier.com/content/author/author_id/6507521314",
                    "ce:indexed-name": "Grigoryeva I.A."
                }
            ]
        }
    }
}