[
    {
        "article": "https://cyberleninka.ru/article/n/razrabotka-prilozheniya-veb-skrapinga-s-vozmozhnostyami-obhoda-blokirovok",
        "title": "Разработка приложения веб-скрапинга с возможностями обхода блокировок",
        "authors": [
            "Москаленко Алексей Анатольевич",
            "Лапонина Ольга Робертовна",
            "Сухомлин Владимир Александрович"
        ],
        "key words": [
            "ВЕБ-СКРАПИНГ",
            "SELENIUM WEBDRIVER",
            "ОБХОД БЛОКИРОВОК ВЕБ-СКРАПЕРОВ",
            "РОТАЦИЯ IP-АДРЕСОВ",
            "ВЕБ-ПРИЛОЖЕНИЕ",
            "WEB-SCRAPING",
            "BYPASS WEB SCRAPER LOCKS",
            "IP ADDRESS ROTATION",
            "WEB-APPLICATION"
        ],
        "publication": "Современные информационные технологии и ИТ-образование",
        "summary": "Рассмотрен  процесс извлечения данных со страниц веб-сайтов в интернете с помощью автоматизации обращений к веб-сайту. С развитием интернета важность  возросла, и более половины интернет-трафика на веб-сайты (за исключением потокового, т.е. аудио и видео) создается автоматизированными средствами, так называемыми ботами. Статья посвящена исследованию процесса веб-скраппинга и изучению проблемы блокировки веб-скраперов в сети Интернет. Рассматриваются основные принципы и понятия процесса . Проводится обзор существующих решений для , выделяются основные достоинства и недостатки веб-скраппинга с возможностью обхода блокировок. Рассматриваются причины блокировки веб-скраперов веб-сайтами, выделены признаки, по которым веб-сайты определяют и блокируют веб-скраперы. Исследуются приемы для  и их влияние на процесс . Предлагается программа, разработанная на языке программирования Python, которая использует приемы для . Программа имеет графический интерфейс, разработанный с помощью фреймворка Tkinter для создания политики веб-скраппинга. Для  используется фреймворк с открытым исходным кодом для автоматизации действий пользователя в браузере . Сравнительный анализ работы веб-скраперов показал, что использование созданных в работе модулей позволяет обойти блокировки .",
        "available to download": "https://cyberleninka.ru/article/n/razrabotka-prilozheniya-veb-skrapinga-s-vozmozhnostyami-obhoda-blokirovok/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/proektirovanie-struktury-programmnoy-sistemy-obrabotki-korpusov-tekstovyh-dokumentov",
        "title": "Проектирование структуры программной системы обработки корпусов текстовых документов",
        "authors": [
            "Барахнин Владимир Борисович",
            "Кожемякина Ольга Юрьевна",
            "Мухамедиев Равиль Ильгизович",
            "Борзилова Юлия Сергеевна",
            "Якунин Кирилл Олегович"
        ],
        "key words": [
            "ОБРАБОТКА ЕСТЕСТВЕННЫХ ЯЗЫКОВ",
            "ПОТОКОВАЯ ОБРАБОТКА ТЕКСТОВ",
            "ИНФОРМАЦИОННАЯ СИСТЕМА АНАЛИЗА ТЕКСТОВ",
            "РАЗРАБОТКА СИСТЕМЫ ОБРАБОТКИ КОРПУСОВ ТЕКСТОВ",
            "NATURAL LANGUAGE PROCESSING",
            "STREAMING WORD PROCESSING",
            "TEXT ANALYSIS INFORMATION SYSTEM",
            "DEVELOPMENT OF A TEXT CORPUS PROCESSING SYSTEM"
        ],
        "publication": "Бизнес-информатика",
        "summary": "Одной из труднорешаемых задач в области интеллектуального анализа данных является разработка универсального инструментария для анализа текстов художественного и делового стиля. Популярным направлением развития алгоритмов обработки корпусов текстовых документов является использование методов машинного обучения, которые позволяют решать задачи . Основанием для проведения исследований в этой области являются такие факторы, как специфика структуры текстов художественного и делового стиля (что требует формирования отдельных наборов данных и, в случае использования методов машинного обучения, дополнительных параметров при обучении), а также отсутствие укомплектованных систем массовой обработки корпусов текстовых документов для русского языка (в отношении научного сообщества в коммерческой среде существуют системы меньших масштабов, решающие узкоспециализированные задачи, например, определение тональности текста). Целью текущего исследования является проектирование и последующая разработка структуры системы обработки корпусов текстовых документов. При проектировании учитывались требования, предъявляемые к широкомасштабным системам: модульность, возможность масштабирования компонентов и их условная независимость. Проектируемая система представляет собой совокупность компонентов, каждый из которых сформирован и используется в виде Docker-контейнеров. Уровни системы: обработка данных, хранение данных, визуализация и управление результатами обработки данных. На уровне обработки данных выполняется сбор (скраппинг) текстовых документов (например, новостных событий) и их дальнейшая обработка с помощью ансамбля методов машинного обучения, каждый из которых реализован в системе как отдельная Airflow-задача. Полученные результаты помещаются для хранения в реляционную базу данных, а для увеличения быстродействия поиска по данным (более 1 млн. единиц) используется инструмент ElasticSearch. Визуализация статистики, полученной в результате работы алгоритмов, осуществляется с использованием плагина Plotly. Администрирование и просмотр обработанных текстов доступны через веб-интерфейс с использованием фреймворка Django. Общая схема взаимодействия компонентов организована по принципу ETL (extract, transform, load). В настоящее время система используется для анализа корпусов новостных текстов с целью сравнительного анализа параметров текстов и средств массовой информации в целом. В перспективе планируется усовершенствование системы и опубликование компонентов в открытом репозитории GitHub для доступа научного сообщества.",
        "available to download": "https://cyberleninka.ru/article/n/proektirovanie-struktury-programmnoy-sistemy-obrabotki-korpusov-tekstovyh-dokumentov/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/primenenie-metoda-intellektualnogo-tekstovogo-analiza-v-otsenke-urovnya-udovletvorennosti-klientov-kommercheskih-bankov",
        "title": "Применение метода интеллектуального текстового анализа в оценке уровня удовлетворенности клиентов коммерческих банков",
        "authors": [
            "Куницына Наталья Николаевна",
            "Метель Юрий Андреевич"
        ],
        "key words": [
            "КОММЕРЧЕСКИЙ БАНК",
            "КЛИЕНТ",
            "ОТЗЫВЫ",
            "УРОВЕНЬ УДОВЛЕТВОРЕННОСТИ КЛИЕНТОВ",
            "ИНТЕЛ-ЛЕКТУАЛЬНЫЙ АНАЛИЗ ТЕКСТА",
            "МАШИННОЕ ОБУЧЕНИЕ",
            "COMMERCIAL BANK",
            "CUSTOMER",
            "REVIEWS",
            "CUSTOMER SATISFACTION",
            "INTELLIGENT TEXT ANALYSIS",
            "MACHINE LEARNING"
        ],
        "publication": "Вестник Саратовского государственного социально-экономического университета",
        "summary": "На основе обработки неструктурированных данных проведена оценка уровня удовлетворенности   Северо-Кавказского федерального округа. Одним из примеров подобных данных выступили  реальных  кредитных организаций. Для автоматизации процесса их сбора и первичной обработки реализована процедура WebScraping на основе высокоуровневого языка программирования общего назначения Python и процедуры стемминга с удалением стоп-слов. На следующем шаге исследования применено вероятностное тематическое моделирование на основе метода латентно-семантического анализа (Latent Semantic Analysis LSA), позволившее выявить наиболее популярные темы. При этом формирование пространства тематик выполнено путем применения сингулярного разложения матрицы dtm. Тональность текста в  определена с помощью подхода, основанного на  с учителем (supervised learning) на базе метода k-ближайших соседей (K-Nearest Neighbors), в результате чего был получен PMML-код модели для последующей автоматизированной оценки . На основе выставленных оценок был рассчитан итоговый  .",
        "available to download": "https://cyberleninka.ru/article/n/primenenie-metoda-intellektualnogo-tekstovogo-analiza-v-otsenke-urovnya-udovletvorennosti-klientov-kommercheskih-bankov/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/retsenziya-na-otkrytyy-onlayn-kurs-python-osnovy-i-primenenie",
        "title": "Рецензия на открытый онлайн курс «Python: основы и применение»",
        "authors": [
            "Гусс Святослав Владимирович"
        ],
        "key words": [],
        "publication": "Электронный научно-методический журнал Омского ГАУ",
        "summary": "none",
        "available to download": "https://cyberleninka.ru/article/n/retsenziya-na-otkrytyy-onlayn-kurs-python-osnovy-i-primenenie/pdf"
    }
]