[
    {
        "article": "https://cyberleninka.ru/article/n/sovremennye-printsipy-i-podhody-k-frontend-arhitekture-veb-prilozheniy",
        "title": "Современные принципы и подходы к Frontend архитектуре веб-приложений",
        "authors": [
            "Сукиасян Владимир Мартунович",
            "Придиус Екатерина Сергеевна"
        ],
        "key words": [
            "АРХИТЕКТУРА",
            "КОМПОНЕНТНЫЙ ПОДХОД",
            "ПОТОК ДАННЫХ",
            "DOM",
            "ПРИНЦИПЫ",
            "ФРОНТЕНД",
            "ARCHITECTURE",
            "COMPONENT ARCHITECTURE",
            "DATA-FLOW",
            "PRINCIPLES",
            "FRONTEND"
        ],
        "publication": "Наука, техника и образование",
        "summary": "В данной статье будет рассмотрено понятие  приложения, критерии хорошо построенной  приложения, понятие , его роль в приложении, структура, а также архитектурные особенности, ставшие актуальными в последнее время. Также будут рассмотрены и проанализированы , на которых строятся современные Frontend-архитектуры веб-приложений, например, таких, как  и  в , их корреляция и сравнение между собой, а также примеры фреймворков, реализующих эти .",
        "available to download": "https://cyberleninka.ru/article/n/sovremennye-printsipy-i-podhody-k-frontend-arhitekture-veb-prilozheniy/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/dpmine-c-c-library-and-graphical-frontend-for-dpmine-workflow-language",
        "title": "DPMine/C: C++ Library and Graphical Frontend for DPMine Workflow Language",
        "authors": [
            "Sergey Shershakov"
        ],
        "key words": [
            "С++ Library",
            "Workflow",
            "Modelling Language",
            "Extensible Tool",
            "Process Mining",
            "Processes",
            "PAIS"
        ],
        "publication": "Proceedings of the Spring/Summer Young Researchers’ Colloquium on Software Engineering",
        "summary": "DPMine generic purpose  language is rooted in DPMine/P scientific  language and a set of plug-ins for ProM which originally were developed for convenient piping of different plug-ins within ProM framework. DPMine/C is a new version of DPMine  language and a C++ library. The main language concept was complemented by comprehensive analysis of DPMine/C model execution semantics. This paper also discusses approaches to the block types extension concept relying on development of new block type classes and customization of the model storage subsystem. Finally, we show an approach for implementation of a GUI frontend.",
        "available to download": "https://cyberleninka.ru/article/n/dpmine-c-c-library-and-graphical-frontend-for-dpmine-workflow-language/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/sravnenie-effektivnosti-ispolzovaniya-razlichnyh-sovremennyh-frontend-freymvorkov-v-korporativnyh-prilozheniyah",
        "title": "Сравнение эффективности использования различных современных фронтенд-фреймворков в корпоративных приложениях",
        "authors": [
            "Зиатдинов Адель Радикович"
        ],
        "key words": [
            "FRONTEND",
            "FRAMEWORKS",
            "UI",
            "UX",
            "COSTS",
            "DOCUMENTATION",
            "ФРОНТЕНД",
            "ФРЕЙМВОРК",
            "СРАВНЕНИЕ",
            "СТОИМОСТЬ",
            "ДОКУМЕНТАЦИЯ"
        ],
        "publication": "StudNet",
        "summary": "Статья посвящена анализу использования различных современных фронтенд-фреймворков при разработке IT-решений.  разработка является перспективным направлением в современном информационном мире, так как является фасадной частью приложения. Умение красиво и удобно представить свой бизнес продукт одна из основных целей при разработке любого корпоративного решения. Основными критериями оценки служат: экономическая составляющая, трудоемкость интеграции, , . Также немаловажным фактором служит наличие объемной  по API. В данной статье представлено  по всем указанным пунктам, а так же анализ сильных и слабых сторон той или иной библиотеки.The article is devoted to the analysis of the use of various modern front-end  in the development of IT solutions.  development is a promising area in the modern information world, as it is a facade part of the application. The ability to beautifully and conveniently present your business product is one of the main goals in the development of any corporate solution. The main evaluation criteria are: the economic component, the complexity of integration, , . Also an important factor is the availability of extensive  on the API. This article presents a comparison of all these points, as well as an analysis of the strengths and weaknesses of a particular library.",
        "available to download": "https://cyberleninka.ru/article/n/sravnenie-effektivnosti-ispolzovaniya-razlichnyh-sovremennyh-frontend-freymvorkov-v-korporativnyh-prilozheniyah/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/sovremennye-tendentsii-razvitiya-veb-razrabotki",
        "title": "Современные тенденции развития веб-разработки",
        "authors": [
            "Куваев Максим Юрьевич",
            "Антимонов Олег Викторович"
        ],
        "key words": [
            "ВЕБ-РАЗРАБОТКА",
            "FRONTEND",
            "BACKEND",
            "ВЕБ-САЙТ",
            "РАЗВИТИЕ",
            "WEB DEVELOPMENT",
            "WEBSITE",
            "DEVELOPMENT"
        ],
        "publication": "StudNet",
        "summary": "Целью данной статьи является определение и рассмотрение современных тенденций в , которые с большой долей вероятности смогут повлиять на дальнейшее  данной перспективной области. Результатом проведенной работы послужит определение и анализ текущих тенденций и направлений в веб-сфере. Исходя из данного материала многие разработчики и начинающие специалисты, планирующие связать свою карьеру с , смогут оценить  данной сферы и точнее определить свое направление.The purpose of this article is to identify and review current trends in , which are very likely to affect the further  of this promising area. The result of this work will be the identification and analysis of current trends and trends in the web sphere. Based on this material, many developers and novice specialists who plan to connect their careers with  will be able to assess the  of this area and more accurately determine their direction.",
        "available to download": "https://cyberleninka.ru/article/n/sovremennye-tendentsii-razvitiya-veb-razrabotki/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/avtomatizirovannoe-testirovanie-frontenda-translyatora-tcg-dlya-qemu",
        "title": "Автоматизированное тестирование фронтенда транслятора tcg для Qemu",
        "authors": [
            "Колтунов Д.С.",
            "Ефимов В.Ю.",
            "Падарян В.А."
        ],
        "key words": [
            "АВТОМАТИЗИРОВАННОЕ ТЕСТИРОВАНИЕ ФРОНТЕНДА TCG",
            "QEMU",
            "AUTOMATED TESTING OF A TCG FRONTEND",
            "QDT",
            "GDB RSP"
        ],
        "publication": "Труды Института системного программирования РАН",
        "summary": "Реализация новой виртуальной процессорной архитектуры в  предполагает создание фронтенда динамического двоичного транслятора TCG для данной процессорной архитектуры. Существующие на сегодняшний день системы тестирования фронтенда TCG используют подход на основе сравнения с эталоном той же процессорной архитектуры. В качестве эталона могут выступать реальный процессор, виртуальная машина с большей точностью эмуляции или другая реализация двоичного транслятора. Однако не всегда такие эталоны доступны, зачастую они могут вообще не существовать. Данная работа нацелена на тестирование реализации процессорной архитектуры в  в условиях отсутствия необходимого эталона для сравнения. Предлагаемый подход основывается на том, что даже для малораспространённой процессорной архитектуры, как правило, доступен пакет binutils и компилятор языка Си. Си-программа может одинаково выполняться на различных процессорных архитектурах, если удаётся избегать в ней ситуаций неопределенного или реализационно зависимого поведения. Это позволяет проводить сравнение хода работы двух разных исполняемых файлов на тестируемой виртуальной машине и машине разработчика. Объектами сравнения такого подхода выступают сущности языка Си, на котором разрабатываются тесты. Подход реализован в программном средстве c2t (CPU Testing Tool) и входит в состав программного комплекса автоматизации разработки моделей устройств и вычислительных машин для , исходный код которого доступен по адресу https://github.com/ispras/. c2t реализовано на языке программирования Python, поддерживает тестирование  в режиме полносистемной эмуляции и в режиме эмуляции уровня пользователя. Данное средство пригодно как для тестирования фронтендов TCG, полученных с использованием системы автоматизации создания фронтендов TCG, так и реализованных классическим способом (вручную).",
        "available to download": "https://cyberleninka.ru/article/n/avtomatizirovannoe-testirovanie-frontenda-translyatora-tcg-dlya-qemu/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/avtomaticheskaya-generatsiya-graficheskih-polzovatelskih-interfeysov-dostupa-k-integrirovannym-dannym-na-osnove-diagramm-klassov-uml",
        "title": "Автоматическая генерация графических пользовательских интерфейсов доступа к интегрированным данным на основе диаграмм классов UML",
        "authors": [
            "Ширяев Д.Р."
        ],
        "key words": [],
        "publication": "Труды Института системного программирования РАН",
        "summary": "Рассмотриваются основные аспекты автоматической генерации GUI на основе диаграммы классов UML модели. Все описываемые идеи были реализованы в рамках компонента Frontend системы BizQuery, разрабатывемой группой MODIS. Тестирование и использование системы показало удобство и эффективность разработанного подхода..",
        "available to download": "https://cyberleninka.ru/article/n/avtomaticheskaya-generatsiya-graficheskih-polzovatelskih-interfeysov-dostupa-k-integrirovannym-dannym-na-osnove-diagramm-klassov-uml/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/avtomatizirovannaya-razrabotka-dinamicheskih-web-uzlov-sredstvami-deklarativnogo-yazyka-programmirovaniya",
        "title": "Автоматизированная разработка динамических Web-узлов средствами декларативного языка программирования",
        "authors": [
            "Кейно П.П.",
            "Силуянов А.В."
        ],
        "key words": [
            "WEB",
            "СЕРВЕРНОЕ ПРОГРАММИРОВАНИЕ",
            "КЛИЕНТСКОЕ ПРОГРАММИРОВАНИЕ",
            "ДЕКЛАРАТИВНОЕ ПРОГРАММИРОВАНИЕ",
            "DECLARATIVE PROGRAMMING",
            "MVC",
            "МОДЕЛИ ДАННЫХ",
            "DATA MODELS",
            "BML",
            "BLOCKSET",
            "HTML",
            "XML",
            "SERVER-SIDE AND CLIENT-SIDE PROGRAMMING",
            "BACKEND",
            "FRONTEND"
        ],
        "publication": "Прикладная информатика",
        "summary": "В статье рассматривается теоретическое обоснование применения новой методологии в разработке Web-узлов серверной и клиентской сторон. Авторами была разработана методология , включающая в себя декларативный язык программирования  и интерпретатор, понимающий этот язык. Рассматриваются преимущества  перед императивным. Отмечена прямая связь структуры  и визуального редактора, с помощью которого стало возможным моделирование логики и представления Web-документа без использования алгоритмического программирования.",
        "available to download": "https://cyberleninka.ru/article/n/avtomatizirovannaya-razrabotka-dinamicheskih-web-uzlov-sredstvami-deklarativnogo-yazyka-programmirovaniya/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/issledovanie-metodov-uvelicheniya-proizvoditelnosti-web-prilozheniy",
        "title": "Исследование методов увеличения производительности WEB-приложений",
        "authors": [
            "Ботыгин Игорь Александрович",
            "Каликин Кирилл Александрович"
        ],
        "key words": [
            "WEB-ПРИЛОЖЕНИЕ",
            "БЫСТРОДЕЙСТВИЕ",
            "КЭШИРОВАНИЕ",
            "ДИНАМИЧЕСКАЯ СТРАНИЦА",
            "СТАТИЧЕСКИЙ ФАЙЛ",
            "ПРОИЗВОДИТЕЛЬНОСТЬ"
        ],
        "publication": "Известия Томского политехнического университета. Инжиниринг георесурсов",
        "summary": "Рассмотрены основные методы увеличения  серверных приложений и проведены имитационные программные эксперименты, направленные на оценку количества запросов обрабатываемых сервером, объемов трафика создаваемого приложениями; требуемого объема оперативной памяти, среднего времени отклика. Показано, что наиболее предпочтительным с точки зрения практического применения является вариант с   на стороне клиента, запуском PHP в режиме FastCGI и обработкой  FrontEnd-сервером Nginx.",
        "available to download": "https://cyberleninka.ru/article/n/issledovanie-metodov-uvelicheniya-proizvoditelnosti-web-prilozheniy/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/osobennosti-yazyka-fdl-v-1-0-dlya-opisaniya-frontenda-veb-prilozheniy",
        "title": "Особенности языка fdl v. 1. 0 для описания фронтенда веб-приложений",
        "authors": [
            "Братин Даниил Юрьевич"
        ],
        "key words": [
            "ДЕКЛАРАТИВНЫЙ ЯЗЫК",
            "ЯЗЫК ОПИСАНИЯ ПОЛЬЗОВАТЕЛЬСКИХ ИНТЕРФЕЙСОВ",
            "РАЗРАБОТКА ВЕБ-ПРИЛОЖЕНИЙ"
        ],
        "publication": "Информатика, телекоммуникации и управление",
        "summary": "Описан микроязык на базе XML, созданный для декларативного описания фронтенда веб-ресурса. Язык даёт возможность описывать структуру ресурса, функциональные возможности программной части и шаблоны страниц. Показано, что его отличием является удобная модель абстракции от реализации приложения и наглядные средства обращения к её компонентам.",
        "available to download": "https://cyberleninka.ru/article/n/osobennosti-yazyka-fdl-v-1-0-dlya-opisaniya-frontenda-veb-prilozheniy/pdf"
    },
    {
        "article": "https://cyberleninka.ru/article/n/poisk-slabyh-navigatsionnyh-signalov-s-pomoschyu-algoritma-double-block-zero-padding",
        "title": "Поиск слабых навигационных сигналов с помощью алгоритма Double block zero Padding",
        "authors": [
            "Закирбаева Г.Х."
        ],
        "key words": [
            "ПОИСК",
            "ГЛОНАСС",
            "DOUBLEBLOCKZEROPADDING (DBZP)",
            "СЛАБЫЕ СИГНАЛЫ"
        ],
        "publication": "Труды Международного симпозиума «Надежность  и качество»",
        "summary": " слабых навигационных сигналов  требует длительного времени интегрирования. В статье рассматриваются два алгоритма с использованием длительного времени интегрирования без какой-либо информации для   системы  при позиционировании внутри помещения. Первый алгоритм это алгоритм циклической корреляции (БПФ/обратное БПФ), а второй алгоритм DoubleBlockZeroPadding (DBZP). Данные были собраны в помещении с помощью frontend-а SDRNAV. Было проведено сравнение алгоритмов по времени вычисления в среде МАТЛАБ. Результаты эксперимента показали, что алгоритм в среднем на 90% быстрее по сравнению с алгоритмом циклической корреляции. Также в результате экспериментов был найден сигнал спутника с помощью алгоритма DoubleBlockZeroPadding (DBZP), в то время как с помощью алгоритма циклической корреляции пик был не различимым, несмотря на длительное время интегрирования. Алгоритм DBZP может быть использован в навигационных приёмниках системы .",
        "available to download": "https://cyberleninka.ru/article/n/poisk-slabyh-navigatsionnyh-signalov-s-pomoschyu-algoritma-double-block-zero-padding/pdf"
    }
]