[
    {
        "article": "https://cyberleninka.ru/article/n/razrabotka-prilozheniya-veb-skrapinga-s-vozmozhnostyami-obhoda-blokirovok",
        "title": "Разработка приложения веб-скрапинга с возможностями обхода блокировок",
        "authors": [
            "Москаленко Алексей Анатольевич",
            "Лапонина Ольга Робертовна",
            "Сухомлин Владимир Александрович"
        ],
        "key words": [
            "ВЕБ-СКРАПИНГ",
            "SELENIUM WEBDRIVER",
            "ОБХОД БЛОКИРОВОК ВЕБ-СКРАПЕРОВ",
            "РОТАЦИЯ IP-АДРЕСОВ",
            "ВЕБ-ПРИЛОЖЕНИЕ",
            "WEB-SCRAPING",
            "BYPASS WEB SCRAPER LOCKS",
            "IP ADDRESS ROTATION",
            "WEB-APPLICATION"
        ],
        "publication": "Современные информационные технологии и ИТ-образование",
        "summary": "Рассмотрен  процесс извлечения данных со страниц веб-сайтов в интернете с помощью автоматизации обращений к веб-сайту. С развитием интернета важность  возросла, и более половины интернет-трафика на веб-сайты (за исключением потокового, т.е. аудио и видео) создается автоматизированными средствами, так называемыми ботами. Статья посвящена исследованию процесса веб-скраппинга и изучению проблемы блокировки веб-скраперов в сети Интернет. Рассматриваются основные принципы и понятия процесса . Проводится обзор существующих решений для , выделяются основные достоинства и недостатки веб-скраппинга с возможностью обхода блокировок. Рассматриваются причины блокировки веб-скраперов веб-сайтами, выделены признаки, по которым веб-сайты определяют и блокируют веб-скраперы. Исследуются приемы для  и их влияние на процесс . Предлагается программа, разработанная на языке программирования Python, которая использует приемы для . Программа имеет графический интерфейс, разработанный с помощью фреймворка Tkinter для создания политики веб-скраппинга. Для  используется фреймворк с открытым исходным кодом для автоматизации действий пользователя в браузере . Сравнительный анализ работы веб-скраперов показал, что использование созданных в работе модулей позволяет обойти блокировки .",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/proektirovanie-veb-skrapera-dlya-polucheniya-dannyh-s-saytov-knizhnyh-izdatelstv",
        "title": "ПРОЕКТИРОВАНИЕ ВЕБ-СКРАПЕРА ДЛЯ ПОЛУЧЕНИЯ ДАННЫХ С САЙТОВ КНИЖНЫХ ИЗДАТЕЛЬСТВ",
        "authors": [
            "Бастрикина В.В."
        ],
        "key words": [
            "ВЕБ-СКРАПИНГ",
            "PYTHON",
            "BEAUTIFULSOUP",
            "REQUESTS",
            "SQLALCHEMY",
            "WEB SCRAPING"
        ],
        "publication": "Актуальные проблемы авиации и космонавтики",
        "summary": "Описан процесс  данных. Предложена структура веб-скрапера для реализации сбора данных с сайтов книжных издательств. Описана технологическая архитектура веб-скрапера.",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/sistema-upravleniya-dostupom-k-resursam-veb-prilozheniy-na-osnove-analiza-povedeniya-polzovatelya",
        "title": "Система управления доступом к ресурсам Веб приложений на основе анализа поведения пользователя",
        "authors": [
            "Москаленко А.А.",
            "Лапонина О.Р.",
            "Сухомлин В.А."
        ],
        "key words": [
            "ВЕБ-СКРАПИНГ",
            "SELENIUM WEBDRIVER",
            "ОБХОД БЛОКИРОВОК ВЕБ-СКРАПЕРОВ",
            "АНОНИМНОСТЬ В СЕТИ ИНТЕРНЕТ",
            "ПАРСИНГ САЙТОВ",
            "WEB-SCRAPING",
            "ANONYMITY ON THE INTERNET"
        ],
        "publication": "International Journal of Open Information Technologies",
        "summary": "рассмотрен  - процесс извлечения данных со страниц веб-сайтов в интернете с помощью автоматизации обращений к веб-сайту. В последнее время задача определения программ веб-скраперов стала актуальна. Об этом свидетельствует появление вакансий компаний, где требуется разработать средства защиты от веб-скраперов и статьи о вредоносной деятельности веб-скраперов. В статье проведено исследование поведения веб-скраперов. Выделены характерные признаки этих программ. Предлагается методика сбора и анализа данных поведения пользователей для определения веб-скраперов. Разработан модуль веб-фреймворка Django для определения программ веб-скраперов. Модуль способен собирать и анализировать данные о поведении пользователя на веб-сайте. Для сбора данных и тестирования работы модуля созданы программы веб-скраперы.",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/chto-skryvaet-russkiy-rep-tematicheskoe-modelirovanie-tekstov-russkoyazychnoy-hip-hop-stseny",
        "title": "ЧТО СКРЫВАЕТ РУССКИЙ РЭП? ТЕМАТИЧЕСКОЕ МОДЕЛИРОВАНИЕ ТЕКСТОВ РУССКОЯЗЫЧНОЙ ХИП-ХОП СЦЕНЫ",
        "authors": [
            "Бойченко Антон Евгеньевич",
            "Жучкова Светлана Васильевна"
        ],
        "key words": [
            "ВЕБ-СКРАПИНГ",
            "ИНТЕЛЛЕКТУАЛЬНЫЙ АНАЛИЗ ТЕКСТОВ",
            "РУССКИЙ РЭП",
            "ТЕМАТИЧЕСКОЕ МОДЕЛИРОВАНИЕ",
            "ХИП-ХОП",
            "BIGARTM",
            "TEXT MINING"
        ],
        "publication": "Журнал социологии и социальной антропологии",
        "summary": "Представлены результаты эксплораторного анализа  на основе корпуса текстов русскоязычных песен этого жанра. Корпус содержит более 11 000 текстов, собранных авторами посредством автоматического извлечения данных с веб-страниц () и покрывающих более 500 исполнителей, творчество которых приходится на разное время и отличается разной степенью известности. Отталкиваясь от идеи о том, что медиа и музыка могут выступать агентом социализации, исследование ставит своей целью поиск тех нарративов, которые представлены в  и которые могут оказывать социализирующее действие на многомиллионную аудиторию жанра, особенно на молодых людей. С помощью модели аддитивной регуляризации  проводится , в результате которого выделяются 17 основных тем, встречающихся в . Анализ результатов  показывает: среди всех тем наиболее распространены в рэпе нарративы поиска и становления себя, несчастной любви и смерти, а реже других встречаются размышления о родине и нарратив успеха. Для определения тех тем, которые транслируются наибольшему числу слушателей, анализируется распространенность полученных тем в текстах трех ключевых исполнителей российской  сцены: Басты, Тимати и Oxxxymiron. С содержательной точки зрения результаты исследования представляют  в неожиданном свете, показывают его особенности по сравнению с рэпом, возникшим в США, и могут быть использованы в качестве источника гипотез для будущих исследований . С методологической точки зрения исследование становится обширной иллюстрацией возможностей применения  в исследованиях социальных наук.",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/prakticheskoe-primenenie-asinhronnogo-programmirovaniya-na-yazyke-python-pri-pomoschi-paketa-asyncio",
        "title": "Практическое применение асинхронного программирования на языке Python при помощи пакета asyncio",
        "authors": [
            "Савостин Петр Алексеевич",
            "Ефремова Наталья Эрнестовна"
        ],
        "key words": [
            "ЯЗЫК ПРОГРАММИРОВАНИЯ PYTHON",
            "БИБЛИОТЕКА ASYNCIO",
            "АСИНХРОННОЕ ПРОГРАММИРОВАНИЕ",
            "ВЕБ-КРАУЛИНГ",
            "ПАРСИНГ",
            "СОПРОГРАММЫ",
            "СКРАПИНГ",
            "GIL",
            "ПАРАЛЛЕЛЬНЫЕ ВЫЧИСЛЕНИЯ",
            "ИЗВЛЕЧЕНИЕ ДАННЫХ"
        ],
        "publication": "Программные системы и вычислительные методы",
        "summary": "Предметом исследования является изучение основных принципов  с помощью пакета Asyncio и их применение для решения прикладных задач на языке Python. Поскольку в интерпретаторе языка Python используется способ синхронизации потоков Global Interpreter Lock, ограничивающий возможность распараллеливания программ на данном языке и, как следствие, не позволяет достичь наибольшей эффективности, использование технологий  позволяет значительно увеличить скорость работы программ на данном языке, обходя упомянутые ограничения. Вышеописанный подход к созданию программ применяется в решении многих задач, например: при создании веб-сервера, клиент-серверного приложения, при  с информационного ресурса веб-краулером. Данная работа посвящена объяснению основных принципов работы с пакетом Asyncio на языке Python. Поскольку русскоязычной литературы по данному пакету зачастую не хватает для того, чтобы понять основы  в языке Python, в этой статье приводятся примеры использования данной технологии с пояснениями.",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/sovmestnoe-ispolzovanie-dopolnennoy-realnosti-i-iskusstvennogo-intellekta-v-obrazovanii",
        "title": "СОВМЕСТНОЕ ИСПОЛЬЗОВАНИЕ ДОПОЛНЕННОЙ РЕАЛЬНОСТИ И ИСКУССТВЕННОГО ИНТЕЛЛЕКТА В ОБРАЗОВАНИИ",
        "authors": [
            "Кургузов Антон Владимирович",
            "Латушкина Валерия Александровна"
        ],
        "key words": [
            "ИСКУССТВЕННЫЙ ИНТЕЛЛЕКТ",
            "ДОПОЛНЕННАЯ РЕАЛЬНОСТЬ",
            "ВИРТУАЛЬНАЯ РЕАЛЬНОСТЬ",
            "ОБРАЗОВАНИЕ",
            "ДИСТАНЦИОННОЕ ОБУЧЕНИЕ",
            "УЧЕБНЫЙ ПРОЦЕСС",
            "МОТИВАЦИЯ",
            "УЧЕБНИК",
            "ПРИЛОЖЕНИЕ",
            "СМАРТФОН",
            "ARTIFICIAL INTELLIGENCE",
            "AUGMENTED REALITY",
            "VIRTUAL REALITY",
            "EDUCATION",
            "DISTANCE LEARNING",
            "EDUCATIONAL PROCESS",
            "MOTIVATION",
            "TEXTBOOK",
            "APPLICATION",
            "SMARTPHONE"
        ],
        "publication": "Проблемы современного педагогического образования",
        "summary": "В статье рассматриваются перспективы использования технологий виртуальной и  в , а также способность их интеграции с технологиями . Рассмотрен вопрос использования этих технологий при заочном или дистанционном формате получения . Целью данного исследования было повысить  обучающихся к учению, а также работе с рекомендованной учебной литературой. Для достижения указанной цели разрабатывается  для мобильных устройств на базе операционной системы Android, работа которого описана в данной статье. Идея нашего исследования заключается в создании системы, которая может разнообразить , дополняя рекомендованные  интеллектуальными функциями и визуальными эффектами. Для разработки  для мобильного устройства использовались языки программирования C# и JavaScript, для серверной части - Python. Для работы системы требуется минимум оборудования:  (с операционной системой Android), сервер и VR-гарнитура (необязательно). Сделан вывод, что для повышения интереса к учебе, а также повышения качества усваиваемого материала целесообразно использование технологий  и  совместно с элементами технологии .",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/web-scraping-i-klassifikatsiya-tekstov-metodom-naivnogo-bayesa",
        "title": "Web-scraping и классификация текстов методом наивного Байеса",
        "authors": [
            "Басалаева А.Ю.",
            "Гареева Г.А.",
            "Григорьева Д.Р."
        ],
        "key words": [
            "ВЕБ-СКРЕПИНГ",
            "МЕТОД НАИВНОГО БАЙЕСА",
            "ОБУЧАЮЩАЯ ВЫБОРКА",
            "ТЕСТОВЫЕ ДАННЫЕ",
            "РАЗРЕЖЕННАЯ МАТРИЦА"
        ],
        "publication": "Инновационная наука",
        "summary": "Классификация текста необходима для решения задачи информационного поиска, заключающаяся в отнесении документа к одной из нескольких категорий на основании содержания документа.",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/izvlechenie-informatsii-iz-slabostrukturirovannyh-veb-stranits",
        "title": "Извлечение информации из слабоструктурированных веб-страниц",
        "authors": [
            "Коляда А. С.",
            "Гогунский В. Д."
        ],
        "key words": [
            "ВЕБ СТРАНИЦА",
            "ИНТЕРНЕТ",
            "ИНФОРМАЦИЯ",
            "СЛАБОСТРУКТУРИРОВАННЫЙ",
            "ИЗВЛЕЧЕНИЕ",
            "WEB PAGE",
            "INTERNET",
            "INFORMATION",
            "SEMISTRUCTURED",
            "EXTRACTION"
        ],
        "publication": "Восточно-Европейский журнал передовых технологий",
        "summary": "Рассматривается проблема обработки данных, представленных в публичном доступе глобальной сети . Определены задачи, решение которых позволяет разрешить проблему. Представлен способ   из   на примере наукометрических баз данных. Разработано программное обеспечение для автоматизации процесса   из наукометрических баз данных и сохранения их с возможностью дальнейшей обработки",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/analiz-zhestkosti-tsen-v-roznichnoy-onlayn-torgovle-moskvy",
        "title": "Анализ жесткости цен в розничной онлайн-торговле Москвы",
        "authors": [
            "Александра Викторовна Божечкова",
            "Алексей Сергеевич Евсеев"
        ],
        "key words": [
            "жесткость цен",
            "денежно-кредитная политика",
            "издержки меню",
            "функция риска",
            "потребительские цены",
            "price rigidity",
            "e-commerce market",
            "menu costs",
            "hazard function",
            "price changes."
        ],
        "publication": "Экономическая политика",
        "summary": "Согласно теоретическим представлениям,  является важнейшим условием работы процентного канала, который в свою очередь является ключевым в контексте политики инфляционного таргетирования, проводимой в том числе в России. В статье исследуется  на продовольственные, непродовольственные товары и услуги. Использованы ежедневные данные онлайн-ритейлеров Москвы за период с февраля 2019 года по май 2020-го. Обнаружено, что средний период неизменности цен составляет 19,5 дня. Распространены малые изменения цен: так, доля изменений цен, не превышающих 5% в абсолютном выражении, составила 34% всех изменений цен и 39% изменений, не связанных с распродажами. Кроме того, наблюдается значительная гетерогенность в частоте изменений цен: так, частота изменения цен на продукты выше, чем на непродовольственные товары, а стоимость услуг меняется реже всего. Наблюдаемое поведение цен демонстрирует, что их изменения зависят и от времени, и от состояния экономики. На зависимость от времени указывает, например, резкий рост вероятности изменения цен на 335-й и 353-й день их неизменности. Этот факт подтверждает выводы ряда зарубежных исследований о том, что их изменение более вероятно в конце и начале года. Проведенный анализ также показывает, что в марте — мае 2020 года фирмы стали изменять цены чаще и на меньшую величину — очевидно, в связи с ростом неопределенности из-за пандемии коронавируса. Если с марта по май 2019 года повышение цен наблюдалось в 50,2% случаев их изменения, то за аналогичный период 2020 года — в 62,7% случаев. Увеличилось количество дней с повышением цен — с 65 до 84 (из 92 дней марта — мая). Таким образом, частота изменений цен определяется как временем, так и ситуацией в экономике.",
        "available to download": true
    },
    {
        "article": "https://cyberleninka.ru/article/n/modeli-importa-dannyh-iz-tvittera",
        "title": "МОДЕЛИ ИМПОРТА ДАННЫХ ИЗ ТВИТТЕРА",
        "authors": [
            "Попов В. А.",
            "Чеповский А. А."
        ],
        "key words": [
            "АНАЛИЗ СОЦИАЛЬНЫХ СЕТЕЙ",
            "ИМПОРТ ДАННЫХ ИЗ СОЦИАЛЬНЫХ СЕТЕЙ",
            "МОДЕЛИ ИНФОРМАЦИОННОГО ВЗАИМОДЕЙСТВИЯ",
            "ВЫДЕЛЕНИЕ СООБЩЕСТВ"
        ],
        "publication": "Вестник Новосибирского государственного университета. Серия: Информационные технологии",
        "summary": "Описываются алгоритм  Twitter и построение взвешенных социальных графов. Для импорта данных за основу берутся заданные посты, скачиваются пользователи, имевшие с ними какое-либо из зафиксированных взаимодействий. Далее алгоритм ориентируется на заданную конфигурацию и по ней вычисляет веса на ребрах полученного графа. Конфигурация учитывает тип взаимодействия пользователей между собой. Авторы вводят понятие (F, L, C, R)-модели информационного взаимодействия.Авторы описывают разработанный алгоритм и реализованное программное обеспечение для построения взвешенных графов. В статье показано применение алгоритма и трех моделей на примере как отдельного поста, так и серии постов.",
        "available to download": true
    }
]