[
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85115679424&origin=inward",
        "title": "Quality of stroke guidelines in low- and middle-income countries: a systematic review",
        "authors": [
            "Joseph Yaria",
            "Akintomiwa Makanjuola",
            "Richard Oguntoye",
            "Morenike Osundina",
            "Olamide Bello",
            "Abisola Lawal",
            "Ajagbe Temitope",
            "Oluwadamilola Adebayo",
            "Mayowa O. Owolabi"
        ],
        "key words": "No key words",
        "publication": "Bulletin of the World Health Organization",
        "summary": "الغرض: تحديد الفجوات في المبادئ التوجيهية الوطنية للسكتة الدماغية التي يمكن سدها لتحسين جودة خدمات رعاية السكتة الدماغية في البلدان منخفضة الدخل والبلدان متوسطة الدخل. الطريقة: قمنا بإجراء البحث بشكل منهجي في قواعد البيانات الطبية والمواقع الإلكترونية للجمعيات الطبية، واتصلنا بالمنظمات الدولية. إن المبادئ التوجيهية الخاصة بكل بلد حول رعاية السكتة الدماغية والسيطرة عليها، بأية لغة منشورة في الفترة من 2010 إلى 2020، كانت مؤهلة ليتم تضمينها. قمنا بمراجعة كل مبدأ توجيهي متضمن لتغطية أربعة مكونات رئيسية لخدمات السكتة الدماغية (المراقبة، والوقاية، والرعاية الدقيقة، وإعادة التأهيل). كما قمنا بتقييم الامتثال لمعايير معهد الطب الثمانية للمبادئ التوجيهية للممارسة الإكلينيكية، وسهولة تنفيذ المبادئ التوجيهية، وخطط النشر بين الجماهير المستهدفة. النتائج: قمنا بمراجعة 108 من المبادئ التوجيهية المؤهلة من 47 بلدًا، بما في ذلك أربعة بلدان منخفضة الدخل، و24 بلدًا متوسط الدخل، و19 بلدًا مرتفع الدخل. على الصعيد العالمي، غطى القليل من المبادئ التوجيهية الوقاية الأولية من السكتة الدماغية، مقارنةً بمكونات الرعاية الأخرى، مع عدم توصية أي منها بالمراقبة. كانت المبادئ التوجيهية حول السكتة الدماغية في البلدان منخفضة الدخل والبلدان متوسطة الدخل أقل من المعايير المطلوبة لتطوير المبادئ التوجيهية؛ وقاعدة الجمهور المستهدف؛ وتغطية المكونات الأربعة لخدمات السكتة الدماغية؛ والتكيف مع السياق الاجتماعي والاقتصادي. عدد المبادئ التوجيهية للبلدان منخفضة الدخل ومتوسطة الدخل التي أظهرت الشفافية أقل من المبادئ التوجيهية من البلدان ذات الدخل المرتفع. اشتمل أقل من ربع المبادئ التوجيهية على خطط تفصيلية للتنفيذ والاعتبارات الاجتماعية الاقتصادية. الاستنتاج: إن المبادئ التوجيهية حول السكتة الدماغية في البلدان ذات الدخل المنخفض، والبلدان ذات الدخل المتوسط، تحتاج إلى تطويرها بالاشتراك مع فئة أكبر من مقدمي الرعاية الصحية وأصحاب المصلحة، مع نطاق كامل من التدخلات القابلة للتفسير والملائمة للسياق.目的: 旨在确定国家中风指南存在的差距，并对这些差距加以弥补以增强中低收入国家中风护理服务的质量。. 方法: 我们系统性地检索了医学数据库和医学会网站，并联系了国际组织。自 2010 年至 2020 年以任何语言发表的针对特定国家的中风护理和控制指南均满足纳入资格。我们回顾了各个指南所涵盖的中风服务四大关键要素（监测、预防、紧急护理和康复）。我们还评估了医学研究所八项临床实践指南标准的遵守情况，指南实施的难易程度以及出于目标群体宣传目的而制定的计划。. 结果: 我们回顾了来自 47 个国家（其中包括 4 个低收入国家、24 个中等收入国家和 19 个高收入国家）的 108 份符合条件的指南。整体而言，与其他护理要素相比，涵盖初级中风预防的指南较少，且没有指南针对监测给出建议。低收入和中等收入国家的中风指南在以下方面低于指南制定所需达到的标准：目标受众的广度、涵盖中风服务的四大要素以及对社会经济环境的适应程度。与高收入国家的指南相比，低收入和中等收入国家的指南透明度较低。不到四分之一的指南涵盖详细的实施计划和社会经济学方面的考虑因素。. 结论: 低收入和中等收入国家的中风指南需要与更广泛的医疗护理提供者以及利益相关者共同制定，并因地制宜地采取一系列可转化的干预调控措施。.(c) 2021 The authors; licensee World Health Organization.Objective: To identify gaps in national stroke guidelines that could be bridged to enhance the quality of stroke care services in low- and middle-income countries. Methods: We systematically searched medical databases and websites of medical societies and contacted international organizations. Country-specific guidelines on care and control of stroke in any language published from 2010 to 2020 were eligible for inclusion. We reviewed each included guideline for coverage of four key components of stroke services (surveillance, prevention, acute care and rehabilitation). We also assessed compliance with the eight Institute of Medicine standards for clinical practice guidelines, the ease of implementation of guidelines and plans for dissemination to target audiences. Findings: We reviewed 108 eligible guidelines from 47 countries, including four low-income, 24 middle-income and 19 high-income countries. Globally, fewer of the guidelines covered primary stroke prevention compared with other components of care, with none recommending surveillance. Guidelines on stroke in low- and middle-income countries fell short of the required standards for guideline development; breadth of target audience; coverage of the four components of stroke services; and adaptation to socioeconomic context. Fewer low- and middle-income country guidelines demonstrated transparency than those from high-income countries. Less than a quarter of guidelines encompassed detailed implementation plans and socioeconomic considerations. Conclusion: Guidelines on stroke in low- and middle-income countries need to be developed in conjunction with a wider category of health-care providers and stakeholders, with a full spectrum of translatable, context-appropriate interventions.Objectif: Identifier les lacunes présentes dans les directives nationales de prise en charge des accidents vasculaires cérébraux (AVC), ainsi que la manière de les combler afin d'améliorer la qualité des soins dans les pays à faible et moyen revenu. Méthodes: Nous avons analysé systématiquement une série de bases de données médicales et sites Internet de sociétés médicales. Nous avons également contacté des organismes internationaux. Toutes les directives nationales de prévention et de prise en charge des AVC, publiées dans n'importe quelle langue entre 2010 et 2020, étaient admises dans cette analyse. Nous avons examiné chaque directive incluse à la recherche de quatre composants clés de la prise en charge des AVC (surveillance, prévention, soins intensifs et rééducation). Enfin, nous avons évalué le degré de conformité avec les huit standards de l'Institut de médecine pour les directives de pratique clinique, mais aussi la facilité avec laquelle ces directives étaient appliquées et la manière dont elles étaient censées être diffusées auprès du public cible. Résultats: Nous avons étudié 108 directives retenues provenant de 47 pays dont quatre à faible revenu, 24 à moyen revenu et 19 à haut revenu. Globalement, le nombre de directives concernant la prévention primaire des AVC était moins élevé que d'autres volets de soins, et aucune ne recommandait une surveillance. Les directives relatives aux AVC dans les pays à faible et moyen revenu ne répondaient pas aux exigences en matière de développement des directives; d'étendue du public cible; d'intégration des quatre composants de prise en charge des AVC; ni d'adaptation au contexte socioéconomique. La transparence des directives nationales était moins souvent assurée dans les pays à faible et moyen revenu que dans les pays à haut revenu. Moins d'un quart des directives comportaient des plans de mise en œuvre détaillés et des considérations économiques. Conclusion: Les directives relatives à la prise en charge des AVC dans les pays à faible et moyen revenu doivent être renforcées avec le concours d'une plus large catégorie de prestataires et d'acteurs du secteur de la santé. Elles doivent en outre prévoir une gamme complète d'interventions transposables sur le terrain et adaptées au contexte.Цель: Выявить пробелы в национальных рекомендациях по инсульту, которые возможно устранить с целью повышения качества услуг по лечению инсульта в странах с низким и средним уровнем доходов. Методы: Авторы систематически проводили поиск в медицинских базах данных и на веб-сайтах медицинских обществ, а также связывались с международными организациями. Национальные рекомендации по лечению и контролю инсульта, опубликованные с 2010 по 2020 г. на любом языке, соответствовали критериям для включения. Авторы изучили каждую включенную рекомендацию в отношении охвата четырьмя ключевыми компонентами услуг по инсульту (эпиднадзор, профилактика, неотложная помощь и реабилитация). Было также оценено соответствие восьми стандартам Института медицины для рекомендаций по клинической практике, простота внедрения рекомендаций и планы по их распространению среди целевых аудиторий. Результаты: Авторы изучили 108 подходящих рекомендаций из 47 стран, включая четыре страны с низким уровнем доходов, 24 страны со средним уровнем доходов и 19 стран с высоким уровнем доходов. Во всем мире первичная профилактика инсульта охватывала меньшее количество рекомендаций по сравнению с другими компонентами медицинской помощи, и ни один из них не рекомендовал эпиднадзор. Рекомендации по инсульту в странах с низким и средним уровнем доходов не соответствовали требуемым стандартам для разработки рекомендаций, широте целевой аудитории, охвату четырьмя компонентами услуг по инсульту и адаптации к социально-экономическим условиям. Рекомендации, принятые в странах с низким и средним уровнем доходов, в меньшей степени демонстрировали прозрачность, в отличие от рекомендаций для стран с высоким уровнем дохода. Менее четверти рекомендаций включали подробные планы по реализации и социально-экономические соображения. Вывод: Рекомендации по инсульту в странах с низким и средним уровнем доходов необходимо разрабатывать совместно с более широкой категорией поставщиков медицинских услуг и заинтересованных сторон, с полным спектром реализуемых и соответствующих обстановке вмешательств.Objetivo: Identificar las lagunas en las directrices nacionales sobre accidentes cerebrovasculares que podrían subsanarse para mejorar la calidad de los servicios de atención a los accidentes cerebrovasculares en los países con ingresos bajos y medios. Métodos: Se realizaron búsquedas sistemáticas en bases de datos médicas y sitios web de sociedades médicas y se contactó con organizaciones internacionales. Se incluyeron las directrices específicas de cada país sobre la atención y el control de los accidentes cerebrovasculares en cualquier idioma, publicadas entre 2010 y 2020. Se revisó cada directriz incluida para la cobertura de cuatro componentes clave de los servicios por ataques cerebrovasculares (vigilancia, prevención, atención aguda y rehabilitación). También se evaluó el cumplimiento de los ocho estándares del Instituto de Medicina para las guías de práctica clínica, la facilidad de implementación de las directrices y los planes de difusión al público objetivo. Resultados: Se revisaron 108 directrices elegibles de 47 países, incluyendo cuatro de bajos ingresos, 24 de medianos ingresos y 19 de altos ingresos. Globalmente, la prevención primaria de los ataques cerebrovasculares estaba cubierta en menos directrices que otros componentes de la atención médica, y ninguna recomendaba la vigilancia. Las directrices sobre ataques cerebrovasculares en los países de ingresos bajos y medios no cumplían con los estándares requeridos para el desarrollo de directrices; la amplitud del público objetivo; la cobertura de los cuatro componentes de los servicios de ataques cerebrovasculares; ni la adaptación al contexto socioeconómico. El número de directrices de los países de ingresos bajos y medios que demostraron ser transparentes fue menor que el de los países de ingresos altos. Menos de una cuarta parte de las directrices incluían planes de aplicación detallados y consideraciones socioeconómicas. Conclusión: Las directrices sobre los ataques cerebrovasculares en los países de ingresos bajos y medios deben elaborarse en colaboración con una categoría más amplia de proveedores de servicios sanitarios y partes interesadas, con un espectro completo de intervenciones traducibles y adecuadas al contexto."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85109295775&origin=inward",
        "title": "Formation of universal competencies of undergraduates during development of the plot of web-questФормирование универсальных компетенций магистрантов при разработке фабулы веб-квеста",
        "authors": [
            "Svetlana V. Zenkina"
        ],
        "key words": [
            "Basic personality traits",
            "Digital technologies",
            "Game space",
            "Interaction",
            "Story elements"
        ],
        "publication": "Perspektivy Nauki i Obrazovania",
        "summary": "© 2021 LLC Ecological Help. All rights reserved.The problem and the aim of the study. The use of innovative technologies for the development of basic personal qualities and supra-subject competencies is a priority direction for the development of the international educational environment. Web-quest is one of the applications of the gamification technology in didactics. The authors suggest that when designing a web-quest, special attention should be paid to working with the formulation of the web-quest plot as an important factor in the formation of universal competencies of undergraduates. Research methods. To determine the sequence of training actions in the development of the plot, the principles of designing the game environment of the quest, the measurement procedures, the system-activity and competence approaches were used. The experiment involved 20 students of Vyatka State University (50% boys and 50% girls) in the specialty 44.04.01 Teacher education. Informatization of education (Master's degree level). Triggers, macros, and hyperlinks are used to implement transitions. The web quest is hosted on the OneDrive. Statistical methods: G-sign test, multiple correlation analysis. Results. During the experiment undergraduates learned to identify and design the elements of the plot; to arrange events in a chronological order of presentation; to establish a logical connection between the facts; to transform the plot into a storyline and back. The empirical value of Gemp=2<Gcr=3 (for p=0.01) obtained in the estimation procedure proves that the changes in the system are not random. The coefficient (0<R1,2,3...N=0.86<1) is calculated, confirming the positive correlation of universal competencies with undergraduates performance. The evaluation of its statistical significance was done (Femp0.01=14.47> Fcrit0.01=5.29). In conclusion we summarize the problems connected with the development on the plot of the web-quest (presentation of facts in chronological order, author's detachment, etc.) and offer recommendations for their resolution: graphic and verbal visualization, numbering of events, the use of well-known literary plots."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85103781103&origin=inward",
        "title": "Adaptation of the web-service of air pollution forecasting for operation within cloud computing platform of the Ukrainian national grid infrastructureАДАПТАЦІЯ ВЕБ-СЕРВІСУ ПРОГНОЗУВАННЯ ЗАБРУДНЕННЯ ПОВІТРЯ ДЛЯ РОБОТИ НА ПЛАТФОРМІ ХМАРНИХ ОБЧИСЛЕНЬ УКРАЇНСЬКОЇ НАЦІОНАЛЬНОЇ ГРІД-ІНФРАСТРУКТУРИ",
        "authors": [
            "I. V. Kovalets",
            "S. Y.A. Maistrenko",
            "O. V. Khalchenkov",
            "O. O. Polonsky",
            "T. O. Dontsov-Zagreba",
            "K. V. Khurtsilava"
        ],
        "key words": [
            "air pollution",
            "Atmospheric dispersion",
            "Cloud computing",
            "Web-systems"
        ],
        "publication": "Science and Innovation",
        "summary": "© Società editrice il MulinoIntroduction. Air pollution modeling is a powerful tool that allows developing scientifically justified solutions to reduce the risks posed by atmospheric emissions of pollutants. Problem Statement. Cloud computing infrastructures provide new opportunities for web-based air pollution forecasting systems. However the implementation of these capabilities requires changes in the architecture of the existing systems. Purpose. The purpose is to adapt the web service of forecasting the atmospheric pollution in Ukraine to operate in the cloud computing platform of the Ukrainian National Grid infrastructure. Materials and Methods. The web client — web server — cloud computing architecture was used. The calculation of the model is performed in the cloud infrastructure, while the client and server parts operate on separate computers. Results. With the developed service the forecast of air pollution is possible for every point at the territory of Ukraine for more than thirty substances, including chlorine, ammonia, hydrogen sulfide and others. The forecast is performed using the data of the WRF-Ukraine numerical weather prediction system and visualized through a web interface. The capabilities of the developed system were demonstrated by the example of simulation of air pollution in part of Kyiv affected by the releases from the Energia incineration plant during pollution episode in September, 2019. The total releases of toluene gas from incineration plant and from the fire on spontaneous waste landfill, which is located a few km from Kyiv, were estimated and analyzed. For the considered period the fire could bring considerable additional amounts of pollutants to the studied region. The confidence interval for the maximum airborne concentration for the considered period is estimated from 0.7 to 2.1 mg · m—3 which is higher than the permissible value (0.6 mg · m—3). Conclusions. The presented system could be used by institutions responsible for response to environmental accidents."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85096201763&origin=inward",
        "title": "Written source on historical geography: Academic publication, database with geodata, web GIS (first experience of an integrated approach)Историко-географический письменный источник: академическое издание, база геоданных, веб-карта (первый опыт комплексного подхода)",
        "authors": [
            "A. Frolov"
        ],
        "key words": [
            "Academic publication",
            "Databases",
            "Geodata",
            "Geographic information systems",
            "Historical geography",
            "Historical source",
            "Web GIS"
        ],
        "publication": "Istoriya",
        "summary": "© 2020 Ltd \"Integration: Education and Science\". All rights reserved.The article discusses perspective for contamination of Russian traditions of academic publication of a written historical source with modern digital approaches to publication. Documents generated by administrations of various Russian offices and corporations have a very important feature. They follow a definite form that facilitates structuring of data of a source. Informative potential of this kind of sources may be increased by converting of text that had been prepared for academic publication to database including spatial component. This approach (just first steps to be more exact) was demonstrated on the example of complex of income books of the Novgorodian archibishop treasury (1576/1577). This is a valuable source on historical geography of Novgorodian land in the 16th century. Academic publication of it issued in 2011 served as a ground for database which in turn was used as a source for web GIS. For logged users the latter allows editing of content strictly via browser."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85078546489&origin=inward",
        "title": "Software and technological support of geoinformation web system for the operative processing and visualization of satellite dataПРОГРАММНО-ТЕХНОЛОГИЧЕСКОЕ ОБЕСПЕЧЕНИЕ ГЕОИНФОРМАЦИОННОЙ ВЕБ-СИСТЕМЫ ОПЕРАТИВНОЙ ОБРАБОТКИ И ВИЗУАЛИЗАЦИИ СПУТНИКОВЫХ ДАННЫХ",
        "authors": [
            "Alexey A. Kadochnikov"
        ],
        "key words": [
            "Geoportal",
            "Geospatial data",
            "GIS",
            "Remote sensing data",
            "Web mapping"
        ],
        "publication": "CEUR Workshop Proceedings",
        "summary": "Copyright © 2019 for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0).The work considers some features of the development of software and technological support tools for loading, processing and publishing of remote sensing data. Described batch processing mechanisms of incoming data and features of preparing data before publishing them in a web application. Methods are proposed for reducing the size of the intermediate data archive for the operation of this web application, the structure of the web application and the technologies and standards used."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85078535730&origin=inward",
        "title": "Web service for the seismic event classification based on Apache spark systemВЕБ-СЕРВИС КЛАССИФИКАЦИИ СЕЙСМИЧЕСКИХ СОБЫТИЙ НА БАЗЕ СИСТЕМЫ РАСПРЕДЕЛЕННЫХ ВЫЧИСЛЕНИЙ APACHE SPARK",
        "authors": [
            "Semyon E. Popov",
            "Roman Yu Zamaraev"
        ],
        "key words": [
            "Apache Spark",
            "Distributed computing",
            "Seismic event classification",
            "Web service"
        ],
        "publication": "CEUR Workshop Proceedings",
        "summary": "Copyright © 2019 for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0).The article describes the key points of the service development process for the rapid automatic classification of seismic signals based on diagnostic templates. Software solutions are presented for preprocessing of the signal and algorithmization of parallel computing on a mathematical model for the generation of final conclusions using the rating voting base. The possibilities of integrating such solutions with the Apache Spark distributed computing system are shown. Performance tests of the classification algorithm for a set of daily signals in various software environments were conducted."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85099990335&origin=inward",
        "title": "Technological aspects of creating a WEB GIS of cultural heritage objects for spatial development of the territory on the example of the novosibirsk regionТЕХНОЛОГИЧЕСКИЕ АСПЕКТЫ СОЗДАНИЯ ВЕБ-ГИС ОБЪЕКТОВ КУЛЬТУРНОГО НАСЛЕДИЯ ДЛЯ ПРОСТРАНСТВЕННОГО РАЗВИТИЯ ТЕРРИТОРИИ НА ПРИМЕРЕ НОВОСИБИРСКОЙ ОБЛАСТИ",
        "authors": [
            "Svetlana S. Yankelevich",
            "Anastasiya O. Lebzak",
            "Evgenii V. Lebzak"
        ],
        "key words": [
            "Cultural heritage sites",
            "Technology of creating web GIS",
            "Web GIS"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "© 2020 Lomonosov Moscow State University. All rights reserved.The level of information security of the cultural heritage of the region has a direct impact on the spatial development of the territory. Most often this is expressed in the quantity and quality of scientific research in this area, measures to protect and popularize the cultural heritage of the region, and, as a result, the level of development of educational tourism in this area. The widespread accessibility of the Internet in our country, as well as the annual enormous increase in the number of mobile Internet users, makes it possible to disseminate a large amount of heterogeneous information as quickly and efficiently as possible. Therefore, web technologies are rationally applied to increase the level of information security of cultural heritage objects. Geospatial information perceived by the user preferably in a graphical form, for example, using interactive maps and web-GIS. To create them, you need to integrate web technologies and geoinformation mapping. The article presents a study of the advantages and disadvantages of using web technologies in cartography. In the process of research, a technology for creating web GIS of cultural heritage objects was developed, based on the integration of web technologies and geoinformation mapping. The article describes in detail the main stages and features of creating such geoinformation products, as well as the requirements for them. A prototype of the web GIS “Cultural heritage of the Novosibirsk region” has been developed.it can be used by any person for educational purposes, as well as by territorial bodies of protection of cultural heritage objects, local governments, construction organizations, road enterprises, land use and subsoil use enterprises, educational and scientific organizations, as well as tour operators and other economic entities."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85099970463&origin=inward",
        "title": "Online web map service for monitoring of snow cover and hazardous hydrological events in the kama river basin: The features of development and contentКАРТОГРАФИЧЕСКИЙ ВЕБ-СЕРВИС МОНИТОРИНГА СНЕЖНОГО ПОКРОВА И ОПАСНЫХ ГИДРОЛОГИЧЕСКИХ ЯВЛЕНИЙ В БАССЕЙНЕ Р. КАМЫ: ОСОБЕННОСТИ СОЗДАНИЯ И ИНФОРМАЦИОННОГО НАПОЛНЕНИЯ",
        "authors": [
            "Sergey V. Pyankov",
            "Rinat K. Abdullin",
            "Andrey N. Shikhov",
            "Anastasia V. Semakina"
        ],
        "key words": [
            "GIS database",
            "Hazardous hydrological events",
            "Online web map service",
            "Rain flood",
            "Spring flood"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "© 2020 Lomonosov Moscow State University. All rights reserved.The development of web-GIS for operational visualization and analysis of the hydrological threats is one of the main ways to improve the monitoring and forecasting of hazardous hydrological events (HHE). This paper considers the structure and content of the online web map service for monitoring snow cover and HHE in the Kama river basin (http://hydromonitor.maps.psu.ru/). The regional departments of the Russian hydro-meteorological service, Kama Basin Water Administration and other institutions interested in operational obtaining of the hydrological information can successfully use the developed web map service. Basic and thematic layers are distinguished in the structure of the web map service. Thematic layers include daily updated monitoring and modelling outputs and other data (that does not require regular updating). The layers of river basins and observational network (weather stations and gauging stations) of the Russian hydro-meteorological service are the information basis of the service. The GIS layers of flooded settlements, locations of ice jams formation on the rivers, HHE and flood zones in floodplains have been created on the basis of the analysis of scientific publications, hydrological gauges, flood damage reports in media and satellite images. The database of HHE includes 97 records (75 HHE), which happened in 63 settlements. Most of HHE causing significant damage were occurred in the Belaya river basin, and the largest areas of flooded floodplain are also located in the same basin. Also, the simulated characteristics of snow cover (snow water equivalent, meltwater outflow and snow-covered area) are published on the web map service. The input data for calculations are daily forecasts of the air temperature, humidity, wind speed and precipitation by numerical weather prediction models ICON (Germany) and GFS (USA), as well as weather station data. The data are updated daily, and their spatial resolution is 3 km."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85099968975&origin=inward",
        "title": "Methodical framework for developing interactive web maps based on the example of struve geodetic arc unesco world heritage siteМЕТОДИЧЕСКИЕ ПРИНЦИПЫ РАЗРАБОТКИ ИНТЕРАКТИВНЫХ ВЕБ-КАРТ НА ПРИМЕРЕ ОБЪЕКТА ВСЕМИРНОГО НАСЛЕДИЯ ЮНЕСКО «ГЕОДЕЗИЧЕСКАЯ ДУГА СТРУВЕ»",
        "authors": [
            "Martin R. Manerov"
        ],
        "key words": [
            "Interactive map",
            "Struve geodetic arc",
            "Web cartography",
            "Web design",
            "World heritage"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "© 2020 Lomonosov Moscow State University. All rights reserved.Today, interactive maps are gaining popularity and are used by both specialists and ordinary users in various fields of science and technology. However, the development of the theoretical base of web cartography and the development of interactive maps lags significantly behind the practical component. Moreover, a systematization of the principles of user-centered design in the field of web mapping is necessary. The aim of this work is to create a methodical framework that can be universal for most interactive web map development projects. The creation of the framework is based on the established scheme of interactive web maps development, the ideas of user-oriented design, as well as on the personal experience of the authors in the development of interactive web maps. The methodical framework covers the following aspects: the need for interactivity of web maps, accessibility on various devices, the dimensional aspect of a map, data structuring, the choice of elements of interaction, the need of usage of third-party maps, multilinguality, the ability to upload user-generated content, the need to create animations, and the choice of the base software. The developed framework helps to form the determining part of the conception of an interactive web map, which is a fundamental step in the proposed process of a web map development. Moreover, the framework facilitates the process of creating interactive web maps and opens up new possibilities and development methods for specialists in web cartography. The authors, using the interactive web map dedicated to the World Heritage Site “Struve Geodetic Arc”, which was developed by them, as an example, clearly demonstrated the conceptual development process based on the methodical framework. The terminology is considered and a new definition of an interactive web map is given."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85096881208&origin=inward",
        "title": "A web tool for managing material for SASA dictionary and the annotation of lexicographic card filesMrežni alat za upravljanje građom rečnika SANU i anotacija listićaВЕБ-АЛАТ ЗА УПРАВЉАЊЕ ГРАЂОМ РЕЧНИКА САНУ И АНОТАЦИЈА ЛИСТИЋА",
        "authors": [
            "Rada Stijović",
            "Ranka Stanković",
            "Mihailo Škorić"
        ],
        "key words": [
            "Annotation",
            "Card files",
            "Digitization",
            "Lexicographic material",
            "Lexicographic tool"
        ],
        "publication": "Rasprave Instituta za Hrvatski Jezik i Jezikoslovlje",
        "summary": "© 2020 Institute of Croatian Language and Linguistics. All rights reserved.The material for the development of the Dictionary of the Serbo-Croatian Standard and Vernacular Language was collected across 160 years and is recorded on roughly 5,000,000 lexicographic citation cards. It was manually excerpted from over 4,500 written sources and collected in the field in all pronunciations of the Štokavian dialect. At least 15 new volumes of the dictionary are planned based on these card files. They can also serve as the basis for various phonetic, morphological, and syntactic research, as well as for analysing language development over the past two centuries, dialectal specifics from the time when the collections were created (often the only data on the speech of a region at the time of collection), and etymological studies. Its cultural value is also exceptional, as it includes contributions from many illustrious names in Serbian cultural history – Jovan Jovanović Zmaj, Jovan Skerlić, Radoje Domanović, Isidora Sekulić, Milan Rešetar, etc. This precious, delicate material was scanned from 2016-2018, and in 2017, a web application was developed to efficiently annotate the electronic cards. It was further enhanced based on user needs, enabling (in addition to constricted annotation, where only card headwords were marked) a more detailed annotation including dictionary entry form, homonym tag, attestation and bibliographic reference, abbreviation in the dictionary, and card type (handwritten, typed). This paper will present the web tool and annotation results from the letter P to Š. So far, 12 different annotators have been working on the annotations, 3-5 annotating simultaneously at any moment with varying intensity. Of the 813 sections with 2,010,508 paper slips, 795 sections with 1,934,583 paper slips were processed with constricted annotation, including 201,487 different headwords. Annotation results will offer an estimation of the remaining number of words for the dictionary SASA with headword list."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85093874711&origin=inward",
        "title": "Web-gis ⇜ecological atlas of the sea of azov⇝ГЕОИНФОРМАЦИОННЫЙ ВЕБ-РЕСУРС «ЭКОЛОГИЧЕСКИЙ АТЛАС АЗОВСКОГО МОРЯ»",
        "authors": [
            "Olga E. Arkhipova"
        ],
        "key words": [
            "Cloud technology",
            "Ecological atlas",
            "Sea of Azov",
            "Web GIS"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "© 2020 Lomonosov Moscow State University. All rights reserved.The methodology for developing a web version of the Electronic Ecological Atlas of the Sea of Azov is based on the use of “cloud” technology of the geoportal - an open platform that is completely built on world industry standards and supports various types of data and services. In 2019, the static part of the Ecological Atlas of the Sea of Azov (Atlas) was completed and posted on the organization's website, based on the use of standard website creation methods. The objective of the study is to expand the standard means of presenting Atlas data by introducing interactive web applications into it. Web applications are developed on the ArcGIS Online platform using Esri standards. As part of the development of the dynamic part of the Atlas, two interactive web applications were created: “Ecological study of the seas of the south of Russia” and “Water Protection Zone of the Sea of Azov”. The application “Ecological study of the seas of the south of Russia” includes thematic maps built on the basis of interactive queries, including maps of the distribution of observation stations by year, by executors and type of observation, as well as infographics and data tables. The web application allows you to create maps that clearly show the results of field research and measurements in the Azov Sea region, as well as allow visual analysis of data from different years, add your own tabular relationships. The purpose of the application developed “Water protection zone of the Azov Sea” is the empowerment of the Atlas through the introduction of interactive web applications tightly themed. One of the objectives is to assess the impact of economic activity on the coastal zone of the Sea of Azov within the water protection zone."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85093855106&origin=inward",
        "title": "Shiftry: Web service for diachronic analysis of Russian newsSHIFTRY: ВЕБ-СЕРВИС ДЛЯ АНАЛИЗА ДИАХРОНИЧЕСКИХ ИЗМЕНЕНИЙ СЛОВ В НОВОСТНЫХ ТЕКСТАХ НА РУССКОМ ЯЗЫКЕ",
        "authors": [
            "A. Kutuzov"
        ],
        "key words": [
            "Diachronic word embeddings",
            "News",
            "Russian",
            "Semantic shifts",
            "Web service"
        ],
        "publication": "Komp'juternaja Lingvistika i Intellektual'nye Tehnologii",
        "summary": "© 2020 ABBYY PRODUCTION LLC. All rights reserved.We present the ShiftRy web service. It helps to analyze temporal changes in the usage of words in news texts from Russian mass media. For that, we employ diachronic word embedding models trained on large Russian news corpora from 2010 up to 2019. The users can explore the usage history of any given query word, or browse the lists of words ranked by the degree of their semantic drift in any couple of years. Visualizations of the words' trajectories through time are provided. Importantly, users can obtain corpus examples with the query word before and after the semantic shift (if any). The aim of ShiftRy is to ease the task of studying word history on short-term time spans, and the influence of social and political events on word usage. The service will be updated with new data yearly."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85077370803&origin=inward",
        "title": "Web-service of intelligent search for planetary data based on the spatial and semantic context on online maps of celestial bodiesВеб-сервис для интеллектуального поиска планетных данных на основе пространственного и семантического контекста онлайн-карт небесных тел",
        "authors": [
            "E. V. Matveev",
            "A. Y. Zharkova",
            "I. P. Karachevtseva"
        ],
        "key words": [
            "GIS",
            "Intelligent search",
            "Online maps of celestial bodies",
            "Planetary data",
            "Web-scraping"
        ],
        "publication": "Sovremennye Problemy Distantsionnogo Zondirovaniya Zemli iz Kosmosa",
        "summary": "© 2019 Space Research Institute of the Russian Academy of Sciences. All rights reserved.We present the results of the development of a specialized web service providing intelligent search for planetary information. The search service was created as part of development of the information system for celestial bodies’ space survey and for access to results by geoportals. The creation of special tools for the intellectualization of search services is caused by the huge volume and diversity of information accumulated in various scientific fields, and in particular, in planetary research. During the development of this service, digital archives of planetary data and software that provide access to the stored information were analyzed. Our results show that the use of implementation of thematic indexing of Internet sources in addition to use of website functions (API), helps improve access to the data providing optimized search. The created web-service for search of planetary data is integrated with online maps of celestial bodies by ArcGIS tools and provides data search taking into account the spatial and semantic content presented on the maps. We plan to use the developed search facilities for the MIIGAiK Planetary Data Geoportal (http://cartsrv.mexlab.ru/geoportal) in the future."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85064690855&origin=inward",
        "title": "An integrated website of electronic data interchange and computer-aided process planning in production outsourcing",
        "authors": [
            "Rika Yunitarini"
        ],
        "key words": [
            "Assembly",
            "CAPP",
            "Communication",
            "EDI",
            "Production outsourcing",
            "Supplier",
            "АСТПВ",
            "Виробничий аутсорсинг",
            "ЕОД",
            "Зв'язок",
            "Постачальник",
            "Складання"
        ],
        "publication": "Eastern-European Journal of Enterprise Technologies",
        "summary": "© 2018 Rika Yunitarini, Pratikto Pratikto, Purnomo Budi santoso, Sugiono Sugiono.The assembly industry implements production outsourcing to meet the needs of assembly product components. The outsourcing of assembly product components is based on a relationship model between the contractor and the industry, between the industry with assembly parts and other processes, and more recently between the assembly parts and sales. In production outsourcing, there are generally no communication patterns established between the contractor/supplier and the assembly team regarding problems that may appear during the assembly process. Electronic data interchange (EDI) technology as a method to promote electronic communication between companies can be implemented for assembly teams and suppliers so that the former can relay component assembly problems during the assembly process. In order to improve coordination and communication with external business partners, the production outsourcing activities need EDI technology so they can communicate rapidly and accurately. To make EDI technology more useful, this method can be integrated with a manufacturing, planning system called computer-aided process planning (CAPP). CAPP is a link between design and manufacturing in a computer-integrated manufacturing environment. Commonly used by manufacturing engineers, CAPP can be used to develop a product manufacturing plan. The purpose of the present study was to design and develop a web-based software application integration initiative between EDI and CAPP that can be used as a communication means between the assembly team and the supplier, which will specifically help the assembly team to plan component assembly process so they can eliminate or reduce manual intervention in assembly planning.Складальне виробництво реалiзує виробничий аутсорсинг для задоволення потреб в компонен- тах складальних виробiв. Аутсорсинг компонентiв складальних виробiв базується на моделi вiдносин мiж пiдрядником та виробництвом, мiж виробни- цтвом та складальними деталями та iншими про- цесами, а в останнiй час мiж складальними дета- лями та продажами. У виробничому аутсорсингу, як правило, вiдсутнi способи зв'язку мiж пiдряд- ником/постачальником та складальною групою щодо проблем, якi можуть виникнути в процесi складання. Технологiя електронного обмiну дани- ми (ЕОД) як спосiб електронного зв'язку мiж ком- панiями може бути реалiзована для складаль- них груп та постачальникiв, так щоб першi могли передавати проблеми складання компонентiв в процесi складання. Для полiпшення координацiї та зв'язку з зовнiшнiми дiловими партнерами, в рам- ках виробничого аутсорсингу необхiдна технологiя ЕОД для швидкого та точного зв'язку. Для того, щоб зробити технологiю ЕОД бiльш корисною, цей метод можна iнтегрувати з вироб- ничою системою планування, що називається автоматизованою системою технологiчної пiд- готовки виробництва (АСТПВ). АСТПВ є зв'язую- чою ланкою мiж проектуванням та виробництвом в середовищi комп'ютерно-iнтегрованого вироб- ництва. АСТПВ, що звичайно використовуєть- ся iнженерами-виробниками, можна застосову- вати для розробки плану виготовлення продукцiї. Метою цього дослiдження було розробити iнiцiа- тиву щодо iнтеграцiї веб-додаткiв мiж ЕОД та АСТПВ, яка може бути використана як засiб зв'яз- ку мiж складальною групою та постачальником, щоконкретно допоможе складальнiй групi плану- вати процес складання компонентiв для виключен- ня або зменшення ручного втручання у планування складання."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85060063733&origin=inward",
        "title": "Towards a more accountable G20? Accountability mechanisms of the G20 and the new challenges posed to them by the 2030 agenda«Группа двадцати»: на пути к большей подотчетности? Механизмы подотчетности «Группы двадцати» и новые вызовы в контексте Повестки дня в области устойчивого развития на период до 2030 г.",
        "authors": [
            "Sören Hilbrich",
            "Jakob Schwab"
        ],
        "key words": [
            "Accountability mechanisms",
            "G20",
            "Sustainable development",
            "Группа двадцати»",
            "Механизмы подотчетности",
            "Устойчивое развитие"
        ],
        "publication": "International Organisations Research Journal",
        "summary": "Легитимность «Группы двадцати» часто подвергается сомнению: институт неоднократно становился объектом критики со стороны не входящих в него государств, негосударственных организаций, академи- ческого сообщества и широкой общественности из-за характера и эффективности принимаемых мер, а также ограниченного состава стран-членов. Механизмы подотчетности способны отчасти сгладить данные противоречия: они могут вовлечь больше граждан из государств - членов «Группы двадцати» в процесс наблюдения за ее деятельностью, чтобы создать основу для внутреннего обучения института с целью повышения его эффективности. Кроме того, механизмы подотчетности, работающие в интересах не входящих в «Группу двадцати» государств, могут сделать «Группу двадцати» более восприимчивой к интересам людей, не проживающих в странах-членах, но на которых решения «Группы двадцати» так или иначе оказывают влияние. В представленной статье мы проанализировали существующие механизмы подотчетности «Груп- пы двадцати» и изучили вызовы, возникающие в связи с принятием Повестки дня в области устойчивого развития на период до 2030 г. в качестве рабочей программы «Группы двадцати». Хотя в рамках «Группы двадцати» имеется платформа, обеспечивающая подотчетность отдельных стран-членов, фокус пред- ставленной работы направлен на механизмы подотчетности «Группы двадцати» в целом как институ- та. Существующие по данной теме публикации позволяют нам выделить три базовых элемента понятия «подотчетность»: прозрачность, обоснованность и обеспечение выполнения обязательств. Внутренние механизмы подотчетности «Группы двадцати» в основном предназначены для поддержания первых двух элементов, так как «Группа двадцати», как и другие неформальные институты управления, не может стать объектом каких-либо формальных санкций. Тем не менее прозрачность и обоснованность, хотя они и являются ценными сами по себе, создают опасность для «Группы двадцати» стать объектом независи- мой критики, а также некоторые репутационные риски. Наиболее надежные механизмы подотчетности «Группы двадцати» включают каналы связи со СМИ, публикацию отчетов о деятельности в широком до- ступе, а также работу в формате аутрич с представителями гражданского, делового и академического сообществ. В конечном счете данные механизмы предназначены для того, чтобы сделать деятельность «Группы двадцати» более подотчетной для граждан стран - членов объединения и за его пределами (прямо или косвенно). Однако в то же время они ставят перед «Группой двадцати» дополнительную задачу по со- отнесению текущей работы с предыдущим опытом. В 2015 г. международное сообщество приняло Повестку дня в области устойчивого развития на пе- риод до 2030 г. в качестве основной стратегии глобального развития. Приняв в 2016 г. План действий по осуществлению Повестки дня в области устойчивого развития на период до 2030 г., «Группа двадцати» приняла на себя обязательства по достижению заявленных целевых показателей, вследствие чего возник- ли новые требования к подотчетности института. Что касается мер, которые могли бы в будущем повысить подотчетность «Группы двадцати» в свете новых требований, связанных с имплементацией Повестки-2030, то можно рассмотреть следу- ющие варианты. Для повышения уровня доверия к механизмам подотчетности «Группы двадцати» не- обходимо дать дорогу независимой оценке. Для того чтобы это стало возможным, деятельность «Группы двадцати» должна стать более прозрачной. Достигнуть этого можно несколькими путями, например, создав постоянный веб-сайт, обеспечив доступ представителей гражданского общества на заседания рабочих групп, публикуя обсуждаемую повестку, протоколы заседаний и пояснительные записки. Также желательно, чтобы самоотчеты были больше сфокусированы на описании деятельности, нежели на оце- ночных суждениях. Для обеспечения согласованности отчетов по действиям в соответствии с Повест- кой-2030 необходимо, чтобы сводный отчет полностью охватывал соответствующие действия стран «Группы двадцати» в так называемых секторах устойчивого развития в рамках Плана действий «Группы двадцати» (а также с учетом Гамбургской актуализации 2017 г.). Всеобъемлющие отчеты о совместных действиях стран «Группы двадцати» могут дополнить отчеты, предоставляемые отдельными странами для Организации Объединенных Наций. Если предоставить аутрич-форматам, таким как Экспертная двадцатка (Т20), доступ к необходимой информации, то они могут сыграть важную роль в предоставле- нии надежной и обоснованной независимой оценки деятельности «Группы двадцати». Это станет значи- тельным шагом на пути к успешной имплементации Повестки-2030, которая требует согласованности действий общества и лиц, принимающих решения. Дальнейшее совершенствование уже имеющихся вну- тренних механизмов подотчетности не сможет компенсировать недостаток легитимности, который связан с эксклюзивным характером членства в «Группе двадцати». С другой стороны, обеспечение «упоря- доченного, согласованного и заслуживающего доверия» процесса подотчетности [G20, 2016, p. 15] может стать ключевым элементом в решении проблемы недостатка легитимности.© 2018 National Research University Higher School of Economics.The legitimacy of the Group of 20 (G20) is frequently challenged: the group has been criticised by non-member states, non-governmental organisations (NGOs) and in both the scientific and broader public debate with regard to the content and effectiveness of its policy measures and its limited membership structure. Accountability mechanisms can attenuate these shortcomings in different ways: they can increase the capacity of the citizens of the member states to surveil the activities of the G20 and can form the basis of learning processes within the group so as to increase effectiveness. In addition, accountability mechanisms directed towards non-member states can make the G20 more receptive to the interests of people who do not live in its own countries but are nevertheless affected by the policies of the G20. In this paper we analyse the existing accountability mechanisms of the G20 and discuss the challenges that the adoption of the 2030 Agenda for Sustainable Development as a guiding framework for G20 work poses to them. While the G20 also constitutes a platform for the reciprocal accountability of its individual member countries, our focus lies on the accountability mechanisms of the institution of the G20 as a whole. Based on the literature, we can identify three elements of accountability: transparency, justification, and enforcement. The institutionalised accountability mechanisms of the G20 are primarily directed at the first two elements of accountability, as the G20 - like all club governance institutions is not subject to any formal sanctioning mechanisms. However, besides being valuable in their own right, transparency and justification make weaker forms of sanctions such as criticism by independent agents as well as reputational effects possible. The most prominent accountability mechanisms of the G20 are its interaction with the media; the publication of accountability reports; and a dialogue process with the so-called Engagement Groups from civil society, business, and academia. In the end, these mechanisms are intended to render the G20 accountable to the citizens within and outside G20 countries (either directly, or mediated by other agents). At the same time, however, they sometimes also fulfil an additional function for the G20 itself, namely tracking its own work towards its commitment to learn from past experiences. In 2015, the international community adopted the 2030 Agenda for Sustainable Development as a universal development agenda. The G20 assumed the principles of the 2030 Agenda and a special responsibility for its implementation through its 2016 G20 Action Plan on the 2030 Agenda for Sustainable Development. Thereby, new challenges for accountability in the G20 have arisen. When looking towards the future, several suggestions for the G20 can be raised in order to increase its accountability, particularly in light of the demands set by its role in the implementation of the 2030 Agenda. To increase the credibility of its accountability processes, it is necessary to allow for more independent evaluation. For this to be possible, the work of the G20 must become first and foremost more transparent. Possible ways to achieve this range from the establishment of a permanent website, over allowing selected civil society members to attend its working group meetings, to publishing agendas, minutes and issue notes. Self-reports should best be concentrated on descriptions rather than selfevaluation. In order to allow for coherent reporting on the 2030 Agenda, one central report should overarchingly cover all relevant G20 actions in the so-called Sustainable Development Sectors (SDSs) of the G20 Action Plan on the 2030 Agenda for Sustainable Development (and its 2017 Hamburg Update). Comprehensive reporting on joint actions taken by the G20 could complement the United Nations follow-up process for individual countries. If given sufficient access to the relevant information, Engagement Groups such as the T20 (Think 20) could play a vital role in providing credible and informed independent evaluation of G20 policies. This would be a particularly promising way forward in the context of the 2030 Agenda, as the agenda will require common efforts by both policymakers and society for its successful implementation. Improving on its existing system of accountability mechanisms cannot fully compensate for the lack of legitimacy that is associated with the exclusionary institutional set-up of the G20. Yet establishing \"streamlined, coherent, and credible\" accountability processes (G20, 2016, p. 15) could prove to be a key element in addressing its legitimacy problems."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85060027341&origin=inward",
        "title": "Intelligent web-interface for access to data of particular importanceІнтелектуальний веб-інтерфейс доступу до даних особливої важливості",
        "authors": [
            "Vladyslav K. Humenok",
            "Igor A. Kotov"
        ],
        "key words": [
            "Authentication",
            "Database",
            "Functional diagram",
            "Information system",
            "Intelligence",
            "Interface",
            "Security",
            "Security",
            "Threats"
        ],
        "publication": "CEUR Workshop Proceedings",
        "summary": "© 2018 CEUR-WS. All Rights Reserved.The purpose of the work is to develop and research the intellectual web-interface of access to data of particular importance. Design object – intelligence information technology access to data of particular importance. In the theoretical part the analysis of security problems of confidential data was carried out, existing methods of information protection were considered, the relevance and objectives of the research were determined. In the practical part of the work, an analysis of the principles of construction of information security systems has been developed, structural and functional and structural models are developed, the intellectual access block of data of special importance has been developed. The level of reliability and stability of the system issues prior to the data selection is investigated, the conclusions are drawn that the developed web-interface allows to increase the level of information security."
    },
    {
        "article": "https://www.scopus.com/inward/record.uri?partnerID=HzOxMe3b&scp=85059502039&origin=inward",
        "title": "Investigation of internet-communities' influence on the social inclusion of the elderly people through leisure practices",
        "authors": [
            "L. A. Vidiasova",
            "I. A. Grigoryeva"
        ],
        "key words": [
            "elderly",
            "engagement",
            "network analysis",
            "network approach",
            "online communities",
            "social inclusion",
            "social networks",
            "weak links"
        ],
        "publication": "Advances in gerontology = Uspekhi gerontologii",
        "summary": "Modern society is characterized by the intensification of new interactions and new communities, in parallel with the interest in social exclusion-inclusion topic. As the Internet develops, the research interest is directed to studying the specifics of emerging communities in a virtual environment called as «online communities», «virtual communities» etc. The article presents the results of studying 7 online communities of older people in the social network VKontakte about leisure. The research was carried out on the basis of a network approach using automated data analysis tools that allows to evaluate communities characteristics, as well as information exchange processes between the participants. The method of network data analysis, automated online community analysis, as well as Gephi software packages and Socstat social network analysis service were used. In addition, qualitative data on content published in communities and offline activities were obtained. The study conducted came to conclusions about the formation of communities characterized by weak online connections between users of older age groups in VKontakte. In the studied groups, the real social community is formed initially in an offline environment where all key activities take place, and their organizers use social networks as one of the channels for informing the target audience. For effective social inclusion, it is necessary to maintain a certain level of trust in what is happening in the group and the information published, as well as relevant content that illuminates activities in an offline environment.Современное общество характеризуется интенсификацией новых видов взаимодействий и новых сообществ, параллельно с интересом к проблеме социальной эксклюзии-инклюзии. По мере развития интернета, исследовательский интерес направляется на изучение специфики сообществ, появляющихся в виртуальной среде и получивших название «онлайн-сообщества», «виртуальные сообщества», «интернет-сообщества» и т. д. В статье представлены результаты изучения семи онлайн-сообществ людей старшего возраста в социальной сети ВКонтакте досуговой направленности. Исследование проведено на основе сетевого подхода с применением средств автоматизированного анализа данных, позволяющего оценить характеристики сообществ, а также процессы информационного обмена между участниками. Использован метод сетевого анализа данных, автоматизированный веб-краулинг онлайн-сообществ, а также программные пакеты Gephi и сервис анализа социальных сетей Socstat. Кроме того, были получены качественные данные о контенте, публикуемом в сообществах, и мероприятиях в оффлайн-среде. Это позволило сделать выводы о формировании сообществ людей старшего возраста в социальной сети ВКонтакте низкой плотности и с преобладанием слабых связей между участниками. Установлено, что реальное социальное сообщество формируется изначально в оффлайн-среде, где происходят все ключевые мероприятия, а их организаторы используют площадки в социальных сетях как один из каналов информирования целевой аудитории. Для эффективной социальной инклюзии необходимо поддержание определенного уровня доверия к происходящему в группе и публикуемым сведениям, а также актуальный контент, освещающий мероприятия в оффлайн-среде."
    }
]