[
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85115679424&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=0&citeCnt=0&searchTerm=",
        "title": "Quality of stroke guidelines in low- and middle-income countries: a systematic review",
        "authors": [
            "Yaria J.a",
            "Gil A.b",
            "Makanjuola A.a",
            "Oguntoye R.a",
            "Miranda J.J.c",
            "Lazo-Porras M.d",
            "Zhang P.e",
            "Tao X.e",
            "Ahlgren J.Á.f",
            "Bernabe-Ortiz A.d",
            "Moscoso-Porras M.c",
            "Malaga G.c"
        ],
        "key words": "No key words",
        "publication": "Bulletin of the World Health Organization",
        "summary": "الغرض: تحديد الفجوات في المبادئ التوجيهية الوطنية للسكتة الدماغية التي يمكن سدها لتحسين جودة خدمات رعاية السكتة الدماغية في البلدان منخفضة الدخل والبلدان متوسطة الدخل. الطريقة: قمنا بإجراء البحث بشكل منهجي في قواعد البيانات الطبية والمواقع الإلكترونية للجمعيات الطبية، واتصلنا بالمنظمات الدولية. إن المبادئ التوجيهية الخاصة بكل بلد حول رعاية السكتة الدماغية والسيطرة عليها، بأية لغة منشورة في الفترة من 2010 إلى 2020، كانت مؤهلة ليتم تضمينها. قمنا بمراجعة كل مبدأ توجيهي متضمن لتغطية أربعة مكونات رئيسية لخدمات السكتة الدماغية (المراقبة، والوقاية، والرعاية الدقيقة، وإعادة التأهيل). كما قمنا بتقييم الامتثال لمعايير معهد الطب الثمانية للمبادئ التوجيهية للممارسة الإكلينيكية، وسهولة تنفيذ المبادئ التوجيهية، وخطط النشر بين الجماهير المستهدفة. النتائج: قمنا بمراجعة 108 من المبادئ التوجيهية المؤهلة من 47 بلدًا، بما في ذلك أربعة بلدان منخفضة الدخل، و24 بلدًا متوسط الدخل، و19 بلدًا مرتفع الدخل. على الصعيد العالمي، غطى القليل من المبادئ التوجيهية الوقاية الأولية من السكتة الدماغية، مقارنةً بمكونات الرعاية الأخرى، مع عدم توصية أي منها بالمراقبة. كانت المبادئ التوجيهية حول السكتة الدماغية في البلدان منخفضة الدخل والبلدان متوسطة الدخل أقل من المعايير المطلوبة لتطوير المبادئ التوجيهية؛ وقاعدة الجمهور المستهدف؛ وتغطية المكونات الأربعة لخدمات السكتة الدماغية؛ والتكيف مع السياق الاجتماعي والاقتصادي. عدد المبادئ التوجيهية للبلدان منخفضة الدخل ومتوسطة الدخل التي أظهرت الشفافية أقل من المبادئ التوجيهية من البلدان ذات الدخل المرتفع. اشتمل أقل من ربع المبادئ التوجيهية على خطط تفصيلية للتنفيذ والاعتبارات الاجتماعية الاقتصادية. الاستنتاج: إن المبادئ التوجيهية حول السكتة الدماغية في البلدان ذات الدخل المنخفض، والبلدان ذات الدخل المتوسط، تحتاج إلى تطويرها بالاشتراك مع فئة أكبر من مقدمي الرعاية الصحية وأصحاب المصلحة، مع نطاق كامل من التدخلات القابلة للتفسير والملائمة للسياق."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85109295775&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=1&citeCnt=0&searchTerm=",
        "title": "[Formation of universal competencies of undergraduates during development of the plot of web-quest]",
        "authors": [
            "Zenkina S.V.a\nОтправить почту на адрес Zenkina S.V.\n",
            "Tsygankova M.N.b\nОтправить почту на адрес Tsygankova M.N.\n",
            "Kharunzheva E.V.c\nОтправить почту на адрес Kharunzheva E.V.\n",
            "Mamaeva E.A.c\nОтправить почту на адрес Mamaeva E.A."
        ],
        "key words": [
            "Basic personality traits;",
            "Digital technologies;",
            "Game space;",
            "Interaction;",
            "Story elements"
        ],
        "publication": "Perspektivy Nauki i Obrazovania",
        "summary": "The problem and the aim of the study. The use of innovative technologies for the development of basic personal qualities and supra-subject competencies is a priority direction for the development of the international educational environment. Web-quest is one of the applications of the gamification technology in didactics. The authors suggest that when designing a web-quest, special attention should be paid to working with the formulation of the web-quest plot as an important factor in the formation of universal competencies of undergraduates. Research methods. To determine the sequence of training actions in the development of the plot, the principles of designing the game environment of the quest, the measurement procedures, the system-activity and competence approaches were used. The experiment involved 20 students of Vyatka State University (50% boys and 50% girls) in the specialty 44.04.01 Teacher education. Informatization of education (Master's degree level). Triggers, macros, and hyperlinks are used to implement transitions. The web quest is hosted on the OneDrive. Statistical methods: G-sign test, multiple correlation analysis. Results. During the experiment undergraduates learned to identify and design the elements of the plot; to arrange events in a chronological order of presentation; to establish a logical connection between the facts; to transform the plot into a storyline and back. The empirical value of Gemp=2<Gcr=3 (for p=0.01) obtained in the estimation procedure proves that the changes in the system are not random. The coefficient (0<R1,2,3...N=0.86<1) is calculated, confirming the positive correlation of universal competencies with undergraduates performance. The evaluation of its statistical significance was done (Femp0.01=14.47> Fcrit0.01=5.29). In conclusion we summarize the problems connected with the development on the plot of the web-quest (presentation of facts in chronological order, author's detachment, etc.) and offer recommendations for their resolution: graphic and verbal visualization, numbering of events, the use of well-known literary plots. © 2021 LLC Ecological Help. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85103781103&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=2&citeCnt=0&searchTerm=",
        "title": "[Adaptation of the web-service of air pollution forecasting for operation within cloud computing platform of the Ukrainian national grid infrastructure]",
        "authors": [
            "Kovalets I.V.a",
            "Maistrenko S.Y.A.a",
            "Khalchenkov O.V.a",
            "Polonsky O.O.a",
            "Dontsov-Zagreba T.O.a",
            "Khurtsilava K.V.a",
            "Udovenko O.I.b"
        ],
        "key words": [
            "air pollution;",
            "Atmospheric dispersion;",
            "Cloud computing;",
            "Web-systems"
        ],
        "publication": "Science and Innovation",
        "summary": "Introduction. Air pollution modeling is a powerful tool that allows developing scientifically justified solutions to reduce the risks posed by atmospheric emissions of pollutants. Problem Statement. Cloud computing infrastructures provide new opportunities for web-based air pollution forecasting systems. However the implementation of these capabilities requires changes in the architecture of the existing systems. Purpose. The purpose is to adapt the web service of forecasting the atmospheric pollution in Ukraine to operate in the cloud computing platform of the Ukrainian National Grid infrastructure. Materials and Methods. The web client — web server — cloud computing architecture was used. The calculation of the model is performed in the cloud infrastructure, while the client and server parts operate on separate computers. Results. With the developed service the forecast of air pollution is possible for every point at the territory of Ukraine for more than thirty substances, including chlorine, ammonia, hydrogen sulfide and others. The forecast is performed using the data of the WRF-Ukraine numerical weather prediction system and visualized through a web interface. The capabilities of the developed system were demonstrated by the example of simulation of air pollution in part of Kyiv affected by the releases from the Energia incineration plant during pollution episode in September, 2019. The total releases of toluene gas from incineration plant and from the fire on spontaneous waste landfill, which is located a few km from Kyiv, were estimated and analyzed. For the considered period the fire could bring considerable additional amounts of pollutants to the studied region. The confidence interval for the maximum airborne concentration for the considered period is estimated from 0.7 to 2.1 mg · m—3 which is higher than the permissible value (0.6 mg · m—3). Conclusions. The presented system could be used by institutions responsible for response to environmental accidents. © Società editrice il Mulino"
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85096201763&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=3&citeCnt=0&searchTerm=",
        "title": "[Written source on historical geography: Academic publication, database with geodata, web GIS (first experience of an integrated approach)]",
        "authors": [
            "Frolov A."
        ],
        "key words": [
            "Academic publication;",
            "Databases;",
            "Geodata;",
            "Geographic information systems;",
            "Historical geography;",
            "Historical source;",
            "Web GIS"
        ],
        "publication": "Istoriya",
        "summary": "The article discusses perspective for contamination of Russian traditions of academic publication of a written historical source with modern digital approaches to publication. Documents generated by administrations of various Russian offices and corporations have a very important feature. They follow a definite form that facilitates structuring of data of a source. Informative potential of this kind of sources may be increased by converting of text that had been prepared for academic publication to database including spatial component. This approach (just first steps to be more exact) was demonstrated on the example of complex of income books of the Novgorodian archibishop treasury (1576/1577). This is a valuable source on historical geography of Novgorodian land in the 16th century. Academic publication of it issued in 2011 served as a ground for database which in turn was used as a source for web GIS. For logged users the latter allows editing of content strictly via browser. © 2020 Ltd \"Integration: Education and Science\". All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85078546489&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=4&citeCnt=0&searchTerm=",
        "title": "[Software and technological support of geoinformation web system for the operative processing and visualization of satellite data]",
        "authors": [
            "Kadochnikov A.A.a",
            "b"
        ],
        "key words": [
            "Geoportal;",
            "Geospatial data;",
            "GIS;",
            "Remote sensing data;",
            "Web mapping",
            "Data handling;",
            "Data visualization;",
            "Geographic information systems;",
            "Monitoring;",
            "Remote sensing",
            "Geo-information;",
            "Geo-spatial data;",
            "Geoportal;",
            "Remote sensing data;",
            "Satellite data;",
            "Technological supports;",
            "WEB application;",
            "Web mapping",
            "Batch data processing"
        ],
        "publication": "CEUR Workshop Proceedings",
        "summary": "The work considers some features of the development of software and technological support tools for loading, processing and publishing of remote sensing data. Described batch processing mechanisms of incoming data and features of preparing data before publishing them in a web application. Methods are proposed for reducing the size of the intermediate data archive for the operation of this web application, the structure of the web application and the technologies and standards used. Copyright © 2019 for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0)."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85078535730&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=5&citeCnt=0&searchTerm=",
        "title": "[Web service for the seismic event classification based on Apache spark system]",
        "authors": [
            "Popov S.E.",
            "Zamaraev R.Yu."
        ],
        "key words": [
            "Apache Spark;",
            "Distributed computing;",
            "Seismic event classification;",
            "Web service",
            "Data handling;",
            "Distributed computer systems;",
            "Monitoring;",
            "Seismology;",
            "Software testing;",
            "Space division multiple access;",
            "Websites",
            "Automatic classification;",
            "Classification algorithm;",
            "Distributed computing systems;",
            "Performance tests;",
            "Seismic event;",
            "Service development;",
            "Software environments;",
            "Software solution",
            "Web services"
        ],
        "publication": "CEUR Workshop Proceedings",
        "summary": "The article describes the key points of the service development process for the rapid automatic classification of seismic signals based on diagnostic templates. Software solutions are presented for preprocessing of the signal and algorithmization of parallel computing on a mathematical model for the generation of final conclusions using the rating voting base. The possibilities of integrating such solutions with the Apache Spark distributed computing system are shown. Performance tests of the classification algorithm for a set of daily signals in various software environments were conducted. Copyright © 2019 for this paper by its authors. Use permitted under Creative Commons License Attribution 4.0 International (CC BY 4.0)."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85099990335&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=6&citeCnt=0&searchTerm=",
        "title": "[Technological aspects of creating a WEB GIS of cultural heritage objects for spatial development of the territory on the example of the novosibirsk region]",
        "authors": [
            "Yankelevich S.S.\nОтправить почту на адрес Yankelevich S.S.\n",
            "Lebzak A.O.\nОтправить почту на адрес Lebzak A.O.\n",
            "Lebzak E.V.\nОтправить почту на адрес Lebzak E.V."
        ],
        "key words": [
            "Cultural heritage sites;",
            "Technology of creating web GIS;",
            "Web GIS"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "The level of information security of the cultural heritage of the region has a direct impact on the spatial development of the territory. Most often this is expressed in the quantity and quality of scientific research in this area, measures to protect and popularize the cultural heritage of the region, and, as a result, the level of development of educational tourism in this area. The widespread accessibility of the Internet in our country, as well as the annual enormous increase in the number of mobile Internet users, makes it possible to disseminate a large amount of heterogeneous information as quickly and efficiently as possible. Therefore, web technologies are rationally applied to increase the level of information security of cultural heritage objects. Geospatial information perceived by the user preferably in a graphical form, for example, using interactive maps and web-GIS. To create them, you need to integrate web technologies and geoinformation mapping. The article presents a study of the advantages and disadvantages of using web technologies in cartography. In the process of research, a technology for creating web GIS of cultural heritage objects was developed, based on the integration of web technologies and geoinformation mapping. The article describes in detail the main stages and features of creating such geoinformation products, as well as the requirements for them. A prototype of the web GIS “Cultural heritage of the Novosibirsk region” has been developed.it can be used by any person for educational purposes, as well as by territorial bodies of protection of cultural heritage objects, local governments, construction organizations, road enterprises, land use and subsoil use enterprises, educational and scientific organizations, as well as tour operators and other economic entities. © 2020 Lomonosov Moscow State University. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85099970463&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=7&citeCnt=0&searchTerm=",
        "title": "[Online web map service for monitoring of snow cover and hazardous hydrological events in the kama river basin: The features of development and content]",
        "authors": [
            "Pyankov S.V.\nОтправить почту на адрес Pyankov S.V.\n",
            "Abdullin R.K.",
            "Shikhov A.N.",
            "Semakina A.V."
        ],
        "key words": [
            "GIS database;",
            "Hazardous hydrological events;",
            "Online web map service;",
            "Rain flood;",
            "Spring flood"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "The development of web-GIS for operational visualization and analysis of the hydrological threats is one of the main ways to improve the monitoring and forecasting of hazardous hydrological events (HHE). This paper considers the structure and content of the online web map service for monitoring snow cover and HHE in the Kama river basin (http://hydromonitor.maps.psu.ru/). The regional departments of the Russian hydro-meteorological service, Kama Basin Water Administration and other institutions interested in operational obtaining of the hydrological information can successfully use the developed web map service. Basic and thematic layers are distinguished in the structure of the web map service. Thematic layers include daily updated monitoring and modelling outputs and other data (that does not require regular updating). The layers of river basins and observational network (weather stations and gauging stations) of the Russian hydro-meteorological service are the information basis of the service. The GIS layers of flooded settlements, locations of ice jams formation on the rivers, HHE and flood zones in floodplains have been created on the basis of the analysis of scientific publications, hydrological gauges, flood damage reports in media and satellite images. The database of HHE includes 97 records (75 HHE), which happened in 63 settlements. Most of HHE causing significant damage were occurred in the Belaya river basin, and the largest areas of flooded floodplain are also located in the same basin. Also, the simulated characteristics of snow cover (snow water equivalent, meltwater outflow and snow-covered area) are published on the web map service. The input data for calculations are daily forecasts of the air temperature, humidity, wind speed and precipitation by numerical weather prediction models ICON (Germany) and GFS (USA), as well as weather station data. The data are updated daily, and their spatial resolution is 3 km. © 2020 Lomonosov Moscow State University. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85099968975&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=8&citeCnt=0&searchTerm=",
        "title": "[Methodical framework for developing interactive web maps based on the example of struve geodetic arc unesco world heritage site]",
        "authors": [
            "Manerov M.R.a\nОтправить почту на адрес Manerov M.R.\n",
            "Syuzyumov A.A.b\nОтправить почту на адрес Syuzyumov A.A.\n",
            "Tyurin S.V.b\nОтправить почту на адрес Tyurin S.V."
        ],
        "key words": [
            "Interactive map;",
            "Struve geodetic arc;",
            "Web cartography;",
            "Web design;",
            "World heritage"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "Today, interactive maps are gaining popularity and are used by both specialists and ordinary users in various fields of science and technology. However, the development of the theoretical base of web cartography and the development of interactive maps lags significantly behind the practical component. Moreover, a systematization of the principles of user-centered design in the field of web mapping is necessary. The aim of this work is to create a methodical framework that can be universal for most interactive web map development projects. The creation of the framework is based on the established scheme of interactive web maps development, the ideas of user-oriented design, as well as on the personal experience of the authors in the development of interactive web maps. The methodical framework covers the following aspects: the need for interactivity of web maps, accessibility on various devices, the dimensional aspect of a map, data structuring, the choice of elements of interaction, the need of usage of third-party maps, multilinguality, the ability to upload user-generated content, the need to create animations, and the choice of the base software. The developed framework helps to form the determining part of the conception of an interactive web map, which is a fundamental step in the proposed process of a web map development. Moreover, the framework facilitates the process of creating interactive web maps and opens up new possibilities and development methods for specialists in web cartography. The authors, using the interactive web map dedicated to the World Heritage Site “Struve Geodetic Arc”, which was developed by them, as an example, clearly demonstrated the conceptual development process based on the methodical framework. The terminology is considered and a new definition of an interactive web map is given. © 2020 Lomonosov Moscow State University. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85096881208&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=9&citeCnt=0&searchTerm=",
        "title": "[A web tool for managing material for SASA dictionary and the annotation of lexicographic card files]",
        "authors": [
            "Stijović R.\nОтправить почту на адрес Stijović R.\n",
            "Stanković R.\nОтправить почту на адрес Stanković R.\n",
            "Škorić M.\nОтправить почту на адрес Škorić M."
        ],
        "key words": [
            "Annotation;",
            "Card files;",
            "Digitization;",
            "Lexicographic material;",
            "Lexicographic tool"
        ],
        "publication": "Rasprave Instituta za Hrvatski Jezik i Jezikoslovlje",
        "summary": "The material for the development of the Dictionary of the Serbo-Croatian Standard and Vernacular Language was collected across 160 years and is recorded on roughly 5,000,000 lexicographic citation cards. It was manually excerpted from over 4,500 written sources and collected in the field in all pronunciations of the Štokavian dialect. At least 15 new volumes of the dictionary are planned based on these card files. They can also serve as the basis for various phonetic, morphological, and syntactic research, as well as for analysing language development over the past two centuries, dialectal specifics from the time when the collections were created (often the only data on the speech of a region at the time of collection), and etymological studies. Its cultural value is also exceptional, as it includes contributions from many illustrious names in Serbian cultural history – Jovan Jovanović Zmaj, Jovan Skerlić, Radoje Domanović, Isidora Sekulić, Milan Rešetar, etc. This precious, delicate material was scanned from 2016-2018, and in 2017, a web application was developed to efficiently annotate the electronic cards. It was further enhanced based on user needs, enabling (in addition to constricted annotation, where only card headwords were marked) a more detailed annotation including dictionary entry form, homonym tag, attestation and bibliographic reference, abbreviation in the dictionary, and card type (handwritten, typed). This paper will present the web tool and annotation results from the letter P to Š. So far, 12 different annotators have been working on the annotations, 3-5 annotating simultaneously at any moment with varying intensity. Of the 813 sections with 2,010,508 paper slips, 795 sections with 1,934,583 paper slips were processed with constricted annotation, including 201,487 different headwords. Annotation results will offer an estimation of the remaining number of words for the dictionary SASA with headword list. © 2020 Institute of Croatian Language and Linguistics. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85093874711&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=10&citeCnt=0&searchTerm=",
        "title": "[Web-gis ⇜ecological atlas of the sea of azov⇝]",
        "authors": [
            "Arkhipova O.E.\nОтправить почту на адрес Arkhipova O.E."
        ],
        "key words": [
            "Cloud technology;",
            "Ecological atlas;",
            "Sea of Azov;",
            "Web GIS"
        ],
        "publication": "InterCarto, InterGIS",
        "summary": "The methodology for developing a web version of the Electronic Ecological Atlas of the Sea of Azov is based on the use of “cloud” technology of the geoportal - an open platform that is completely built on world industry standards and supports various types of data and services. In 2019, the static part of the Ecological Atlas of the Sea of Azov (Atlas) was completed and posted on the organization's website, based on the use of standard website creation methods. The objective of the study is to expand the standard means of presenting Atlas data by introducing interactive web applications into it. Web applications are developed on the ArcGIS Online platform using Esri standards. As part of the development of the dynamic part of the Atlas, two interactive web applications were created: “Ecological study of the seas of the south of Russia” and “Water Protection Zone of the Sea of Azov”. The application “Ecological study of the seas of the south of Russia” includes thematic maps built on the basis of interactive queries, including maps of the distribution of observation stations by year, by executors and type of observation, as well as infographics and data tables. The web application allows you to create maps that clearly show the results of field research and measurements in the Azov Sea region, as well as allow visual analysis of data from different years, add your own tabular relationships. The purpose of the application developed “Water protection zone of the Azov Sea” is the empowerment of the Atlas through the introduction of interactive web applications tightly themed. One of the objectives is to assess the impact of economic activity on the coastal zone of the Sea of Azov within the water protection zone. © 2020 Lomonosov Moscow State University. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85093855106&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=11&citeCnt=0&searchTerm=",
        "title": "[Shiftry: Web service for diachronic analysis of Russian news]",
        "authors": [
            "Kutuzov A.a\nОтправить почту на адрес Kutuzov A.\n",
            "Fomin V.b\nОтправить почту на адрес Fomin V.\n",
            "Mikhailov V.b",
            "c\nОтправить почту на адрес Mikhailov V.\n",
            "Rodina J.b\nОтправить почту на адрес Rodina J."
        ],
        "key words": [
            "Diachronic word embeddings;",
            "News;",
            "Russian;",
            "Semantic shifts;",
            "Web service"
        ],
        "publication": "Komp'juternaja Lingvistika i Intellektual'nye Tehnologii",
        "summary": "We present the ShiftRy web service. It helps to analyze temporal changes in the usage of words in news texts from Russian mass media. For that, we employ diachronic word embedding models trained on large Russian news corpora from 2010 up to 2019. The users can explore the usage history of any given query word, or browse the lists of words ranked by the degree of their semantic drift in any couple of years. Visualizations of the words' trajectories through time are provided. Importantly, users can obtain corpus examples with the query word before and after the semantic shift (if any). The aim of ShiftRy is to ease the task of studying word history on short-term time spans, and the influence of social and political events on word usage. The service will be updated with new data yearly. © 2020 ABBYY PRODUCTION LLC. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85077370803&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=12&citeCnt=0&searchTerm=",
        "title": "[Web-service of intelligent search for planetary data based on the spatial and semantic context on online maps of celestial bodies]",
        "authors": [
            "Matveev E.V.a\nОтправить почту на адрес Matveev E.V.\n",
            "Zharkova A.Y.a",
            "b\nОтправить почту на адрес Zharkova A.Y.\n",
            "Karachevtseva I.P.a"
        ],
        "key words": [
            "GIS;",
            "Intelligent search;",
            "Online maps of celestial bodies;",
            "Planetary data;",
            "Web-scraping"
        ],
        "publication": "Sovremennye Problemy Distantsionnogo Zondirovaniya Zemli iz Kosmosa",
        "summary": "We present the results of the development of a specialized web service providing intelligent search for planetary information. The search service was created as part of development of the information system for celestial bodies’ space survey and for access to results by geoportals. The creation of special tools for the intellectualization of search services is caused by the huge volume and diversity of information accumulated in various scientific fields, and in particular, in planetary research. During the development of this service, digital archives of planetary data and software that provide access to the stored information were analyzed. Our results show that the use of implementation of thematic indexing of Internet sources in addition to use of website functions (API), helps improve access to the data providing optimized search. The created web-service for search of planetary data is integrated with online maps of celestial bodies by ArcGIS tools and provides data search taking into account the spatial and semantic content presented on the maps. We plan to use the developed search facilities for the MIIGAiK Planetary Data Geoportal (http://cartsrv.mexlab.ru/geoportal) in the future. © 2019 Space Research Institute of the Russian Academy of Sciences. All rights reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85064690855&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=13&citeCnt=0&searchTerm=",
        "title": "An integrated website of electronic data interchange and computer-aided process planning in production outsourcing",
        "authors": [
            "Yunitarini R.a\nОтправить почту на адрес Yunitarini R.\n",
            "Pratikto P.b\nОтправить почту на адрес Pratikto P.\n",
            "Santoso P.B.c\nОтправить почту на адрес Santoso P.B.\n",
            "Sugiono S.c\nОтправить почту на адрес Sugiono S."
        ],
        "key words": [
            "Assembly;",
            "CAPP;",
            "Communication;",
            "EDI;",
            "Production outsourcing;",
            "Supplier;",
            "АСТПВ;",
            "Виробничий аутсорсинг;",
            "ЕОД;",
            "Зв'язок;",
            "Постачальник;",
            "Складання"
        ],
        "publication": "Eastern-European Journal of Enterprise Technologies",
        "summary": "The assembly industry implements production outsourcing to meet the needs of assembly product components. The outsourcing of assembly product components is based on a relationship model between the contractor and the industry, between the industry with assembly parts and other processes, and more recently between the assembly parts and sales. In production outsourcing, there are generally no communication patterns established between the contractor/supplier and the assembly team regarding problems that may appear during the assembly process. Electronic data interchange (EDI) technology as a method to promote electronic communication between companies can be implemented for assembly teams and suppliers so that the former can relay component assembly problems during the assembly process. In order to improve coordination and communication with external business partners, the production outsourcing activities need EDI technology so they can communicate rapidly and accurately. To make EDI technology more useful, this method can be integrated with a manufacturing, planning system called computer-aided process planning (CAPP). CAPP is a link between design and manufacturing in a computer-integrated manufacturing environment. Commonly used by manufacturing engineers, CAPP can be used to develop a product manufacturing plan. The purpose of the present study was to design and develop a web-based software application integration initiative between EDI and CAPP that can be used as a communication means between the assembly team and the supplier, which will specifically help the assembly team to plan component assembly process so they can eliminate or reduce manual intervention in assembly planning. © 2018 Rika Yunitarini, Pratikto Pratikto, Purnomo Budi santoso, Sugiono Sugiono."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85060063733&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=14&citeCnt=2&searchTerm=",
        "title": "[Towards a more accountable G20? Accountability mechanisms of the G20 and the new challenges posed to them by the 2030 agenda]",
        "authors": [
            "Hilbrich S.\nОтправить почту на адрес Hilbrich S.\n",
            "Schwab J.\nОтправить почту на адрес Schwab J."
        ],
        "key words": [
            "Accountability mechanisms;",
            "G20;",
            "Sustainable development;",
            "Группа двадцати»;",
            "Механизмы подотчетности;",
            "Устойчивое развитие"
        ],
        "publication": "International Organisations Research Journal",
        "summary": "Легитимность «Группы двадцати» часто подвергается сомнению: институт неоднократно становился объектом критики со стороны не входящих в него государств, негосударственных организаций, академи- ческого сообщества и широкой общественности из-за характера и эффективности принимаемых мер, а также ограниченного состава стран-членов. Механизмы подотчетности способны отчасти сгладить данные противоречия: они могут вовлечь больше граждан из государств - членов «Группы двадцати» в процесс наблюдения за ее деятельностью, чтобы создать основу для внутреннего обучения института с целью повышения его эффективности. Кроме того, механизмы подотчетности, работающие в интересах не входящих в «Группу двадцати» государств, могут сделать «Группу двадцати» более восприимчивой к интересам людей, не проживающих в странах-членах, но на которых решения «Группы двадцати» так или иначе оказывают влияние. В представленной статье мы проанализировали существующие механизмы подотчетности «Груп- пы двадцати» и изучили вызовы, возникающие в связи с принятием Повестки дня в области устойчивого развития на период до 2030 г. в качестве рабочей программы «Группы двадцати». Хотя в рамках «Группы двадцати» имеется платформа, обеспечивающая подотчетность отдельных стран-членов, фокус пред- ставленной работы направлен на механизмы подотчетности «Группы двадцати» в целом как институ- та. Существующие по данной теме публикации позволяют нам выделить три базовых элемента понятия «подотчетность»: прозрачность, обоснованность и обеспечение выполнения обязательств. Внутренние механизмы подотчетности «Группы двадцати» в основном предназначены для поддержания первых двух элементов, так как «Группа двадцати», как и другие неформальные институты управления, не может стать объектом каких-либо формальных санкций. Тем не менее прозрачность и обоснованность, хотя они и являются ценными сами по себе, создают опасность для «Группы двадцати» стать объектом независи- мой критики, а также некоторые репутационные риски. Наиболее надежные механизмы подотчетности «Группы двадцати» включают каналы связи со СМИ, публикацию отчетов о деятельности в широком до- ступе, а также работу в формате аутрич с представителями гражданского, делового и академического сообществ. В конечном счете данные механизмы предназначены для того, чтобы сделать деятельность «Группы двадцати» более подотчетной для граждан стран - членов объединения и за его пределами (прямо или косвенно). Однако в то же время они ставят перед «Группой двадцати» дополнительную задачу по со- отнесению текущей работы с предыдущим опытом. В 2015 г. международное сообщество приняло Повестку дня в области устойчивого развития на пе- риод до 2030 г. в качестве основной стратегии глобального развития. Приняв в 2016 г. План действий по осуществлению Повестки дня в области устойчивого развития на период до 2030 г., «Группа двадцати» приняла на себя обязательства по достижению заявленных целевых показателей, вследствие чего возник- ли новые требования к подотчетности института. Что касается мер, которые могли бы в будущем повысить подотчетность «Группы двадцати» в свете новых требований, связанных с имплементацией Повестки-2030, то можно рассмотреть следу- ющие варианты. Для повышения уровня доверия к механизмам подотчетности «Группы двадцати» не- обходимо дать дорогу независимой оценке. Для того чтобы это стало возможным, деятельность «Группы двадцати» должна стать более прозрачной. Достигнуть этого можно несколькими путями, например, создав постоянный веб-сайт, обеспечив доступ представителей гражданского общества на заседания рабочих групп, публикуя обсуждаемую повестку, протоколы заседаний и пояснительные записки. Также желательно, чтобы самоотчеты были больше сфокусированы на описании деятельности, нежели на оце- ночных суждениях. Для обеспечения согласованности отчетов по действиям в соответствии с Повест- кой-2030 необходимо, чтобы сводный отчет полностью охватывал соответствующие действия стран «Группы двадцати» в так называемых секторах устойчивого развития в рамках Плана действий «Группы двадцати» (а также с учетом Гамбургской актуализации 2017 г.). Всеобъемлющие отчеты о совместных действиях стран «Группы двадцати» могут дополнить отчеты, предоставляемые отдельными странами для Организации Объединенных Наций. Если предоставить аутрич-форматам, таким как Экспертная двадцатка (Т20), доступ к необходимой информации, то они могут сыграть важную роль в предоставле- нии надежной и обоснованной независимой оценки деятельности «Группы двадцати». Это станет значи- тельным шагом на пути к успешной имплементации Повестки-2030, которая требует согласованности действий общества и лиц, принимающих решения. Дальнейшее совершенствование уже имеющихся вну- тренних механизмов подотчетности не сможет компенсировать недостаток легитимности, который связан с эксклюзивным характером членства в «Группе двадцати». С другой стороны, обеспечение «упоря- доченного, согласованного и заслуживающего доверия» процесса подотчетности [G20, 2016, p. 15] может стать ключевым элементом в решении проблемы недостатка легитимности."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85060027341&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=15&citeCnt=1&searchTerm=",
        "title": "[Intelligent web-interface for access to data of particular importance]",
        "authors": [
            "Humenok V.K.\nОтправить почту на адрес Humenok V.K.\n",
            "Kotov I.A.\nОтправить почту на адрес Kotov I.A."
        ],
        "key words": [
            "Authentication;",
            "Database;",
            "Functional diagram;",
            "Information system;",
            "Intelligence;",
            "Interface;",
            "Security;",
            "Security;",
            "Threats",
            "Authentication;",
            "Database systems;",
            "Information systems;",
            "Interfaces (materials);",
            "Security of data;",
            "Software engineering;",
            "System stability",
            "Confidential data;",
            "Functional diagrams;",
            "Information protection;",
            "Intelligence;",
            "Reliability and stability;",
            "Security;",
            "Security problems;",
            "Threats",
            "Engineering research"
        ],
        "publication": "CEUR Workshop Proceedings",
        "summary": "The purpose of the work is to develop and research the intellectual web-interface of access to data of particular importance. Design object – intelligence information technology access to data of particular importance. In the theoretical part the analysis of security problems of confidential data was carried out, existing methods of information protection were considered, the relevance and objectives of the research were determined. In the practical part of the work, an analysis of the principles of construction of information security systems has been developed, structural and functional and structural models are developed, the intellectual access block of data of special importance has been developed. The level of reliability and stability of the system issues prior to the data selection is investigated, the conclusions are drawn that the developed web-interface allows to increase the level of information security. © 2018 CEUR-WS. All Rights Reserved."
    },
    {
        "article": "https://www.scopus.com/record/display.uri?eid=2-s2.0-85059502039&origin=resultslist&sort=plf-f&src=s&sid=a8ca21b3d6f1a6bbe11255d8e1fc1703&sot=b&sdt=b&sl=18&s=TITLE-ABS-KEY%28%d0%b2%d0%b5%d0%b1%29&relpos=16&citeCnt=0&searchTerm=",
        "title": "Investigation of internet-communities' influence on the social inclusion of the elderly people through leisure practices",
        "authors": [
            "Vidiasova L.A.a",
            "Grigoryeva I.A.a",
            "b"
        ],
        "key words": [
            "elderly;",
            "engagement;",
            "network analysis;",
            "network approach;",
            "online communities;",
            "social inclusion;",
            "social networks;",
            "weak links",
            "Aged;",
            "Humans;",
            "Internet;",
            "Leisure Activities;",
            "Social Participation",
            "aged;",
            "human;",
            "Internet;",
            "leisure;",
            "psychology;",
            "social participation"
        ],
        "publication": "Advances in gerontology = Uspekhi gerontologii",
        "summary": "Modern society is characterized by the intensification of new interactions and new communities, in parallel with the interest in social exclusion-inclusion topic. As the Internet develops, the research interest is directed to studying the specifics of emerging communities in a virtual environment called as «online communities», «virtual communities» etc. The article presents the results of studying 7 online communities of older people in the social network VKontakte about leisure. The research was carried out on the basis of a network approach using automated data analysis tools that allows to evaluate communities characteristics, as well as information exchange processes between the participants. The method of network data analysis, automated online community analysis, as well as Gephi software packages and Socstat social network analysis service were used. In addition, qualitative data on content published in communities and offline activities were obtained. The study conducted came to conclusions about the formation of communities characterized by weak online connections between users of older age groups in VKontakte. In the studied groups, the real social community is formed initially in an offline environment where all key activities take place, and their organizers use social networks as one of the channels for informing the target audience. For effective social inclusion, it is necessary to maintain a certain level of trust in what is happening in the group and the information published, as well as relevant content that illuminates activities in an offline environment."
    }
]